module.exports = [{
    n: "北京",
    l: [{
        n: "朝阳区",
        l: [{n: "三环以内", l: []}, {n: "三环到四环之间", l: []}, {n: "四环到五环之间", l: []}, {
            n: "五环到六环之间",
            l: []
        }, {n: "管庄", l: []}, {n: "北苑", l: []}, {n: "定福庄", l: []}]
    }, {
        n: "海淀区",
        l: [{n: "三环以内", l: []}, {n: "三环到四环之间", l: []}, {n: "四环到五环之间", l: []}, {
            n: "五环到六环之间",
            l: []
        }, {n: "六环以外", l: []}, {n: "西三旗", l: []}, {n: "西二旗", l: []}]
    }, {n: "西城区", l: [{n: "内环到二环里", l: []}, {n: "二环到三环", l: []}]}, {
        n: "东城区",
        l: [{n: "内环到三环里", l: []}]
    }, {n: "崇文区", l: [{n: "一环到二环", l: []}, {n: "二环到三环", l: []}]}, {
        n: "宣武区",
        l: [{n: "内环到三环里", l: []}]
    }, {
        n: "丰台区",
        l: [{n: "四环到五环之间", l: []}, {n: "二环到三环", l: []}, {
            n: "三环到四环之间",
            l: []
        }, {n: "五环到六环之间", l: []}, {n: "六环之外", l: []}]
    }, {
        n: "石景山区",
        l: [{n: "四环到五环内", l: []}, {n: "石景山城区", l: []}, {n: "八大处科技园区", l: []}]
    }, {
        n: "门头沟",
        l: [{n: "城区", l: []}, {n: "龙泉镇", l: []}, {n: "永定镇", l: []}, {
            n: "大台镇",
            l: []
        }, {n: "潭柘寺镇", l: []}, {n: "王平镇", l: []}, {n: "军庄镇", l: []}, {
            n: "妙峰山镇",
            l: []
        }, {n: "雁翅镇", l: []}, {n: "斋堂镇", l: []}, {n: "清水镇", l: []}]
    }, {
        n: "房山区",
        l: [{n: "城区", l: []}, {n: "大安山乡", l: []}, {n: "大石窝镇", l: []}, {
            n: "窦店镇",
            l: []
        }, {n: "佛子庄乡", l: []}, {n: "韩村河镇", l: []}, {n: "河北镇", l: []}, {
            n: "良乡镇",
            l: []
        }, {n: "琉璃河镇", l: []}, {n: "南窖乡", l: []}, {n: "蒲洼乡", l: []}, {
            n: "青龙湖镇",
            l: []
        }, {n: "十渡镇", l: []}, {n: "石楼镇", l: []}, {n: "史家营乡", l: []}, {
            n: "霞云岭乡",
            l: []
        }, {n: "新镇", l: []}, {n: "阎村镇", l: []}, {n: "燕山地区", l: []}, {
            n: "张坊镇",
            l: []
        }, {n: "长沟镇", l: []}, {n: "长阳镇", l: []}, {n: "周口店镇", l: []}]
    }, {
        n: "通州区",
        l: [{n: "六环内（马驹桥镇）", l: []}, {n: "六环外（马驹桥镇）", l: []}, {n: "永顺镇", l: []}, {
            n: "梨园镇",
            l: []
        }, {n: "宋庄镇", l: []}, {n: "漷县镇", l: []}, {n: "张家湾镇", l: []}, {
            n: "西集镇",
            l: []
        }, {n: "永乐店镇", l: []}, {n: "潞城镇", l: []}, {n: "台湖镇", l: []}, {
            n: "于家务乡",
            l: []
        }, {n: "中仓街道", l: []}, {n: "新华街道", l: []}, {n: "玉桥街道", l: []}, {
            n: "北苑街道",
            l: []
        }, {n: "次渠镇", l: []}]
    }, {
        n: "大兴区",
        l: [{n: "四环至五环之间", l: []}, {n: "六环以外", l: []}, {n: "五环至六环之间", l: []}, {
            n: "亦庄经济开发区",
            l: []
        }]
    }, {
        n: "顺义区",
        l: [{n: "北石槽镇", l: []}, {n: "北务镇", l: []}, {n: "北小营镇", l: []}, {
            n: "大孙各庄镇",
            l: []
        }, {n: "高丽营镇", l: []}, {n: "光明街道", l: []}, {n: "后沙峪地区", l: []}, {
            n: "空港街道",
            l: []
        }, {n: "李桥镇", l: []}, {n: "李遂镇", l: []}, {n: "龙湾屯镇", l: []}, {
            n: "马坡地区",
            l: []
        }, {n: "木林镇", l: []}, {n: "南彩镇", l: []}, {n: "南法信地区", l: []}, {
            n: "牛栏山地区",
            l: []
        }, {n: "仁和地区", l: []}, {n: "胜利街道", l: []}, {n: "石园街道", l: []}, {
            n: "双丰街道",
            l: []
        }, {n: "天竺地区", l: []}, {n: "旺泉街道", l: []}, {n: "杨镇地区", l: []}, {
            n: "张镇",
            l: []
        }, {n: "赵全营镇", l: []}]
    }, {n: "怀柔区", l: [{n: "郊区", l: []}, {n: "城区以内", l: []}]}, {
        n: "密云区",
        l: [{n: "城区以外", l: []}, {n: "城区", l: []}]
    }, {
        n: "昌平区",
        l: [{n: "城区以外", l: []}, {n: "六环以内", l: []}, {n: "城区", l: []}]
    }, {n: "平谷区", l: [{n: "城区以外", l: []}, {n: "城区", l: []}]}, {
        n: "延庆县",
        l: [{n: "延庆镇", l: []}, {n: "城区", l: []}, {n: "康庄镇", l: []}, {
            n: "八达岭镇",
            l: []
        }, {n: "永宁镇", l: []}, {n: "旧县镇", l: []}, {n: "张山营镇", l: []}, {
            n: "四海镇",
            l: []
        }, {n: "千家店镇", l: []}, {n: "沈家营镇", l: []}, {n: "大榆树镇", l: []}, {
            n: "井庄镇",
            l: []
        }, {n: "大庄科乡", l: []}, {n: "刘斌堡乡", l: []}, {n: "香营乡", l: []}, {n: "珍珠泉乡", l: []}]
    }]
}, {
    n: "上海",
    l: [{n: "黄浦区", l: [{n: "城区", l: []}]}, {
        n: "徐汇区",
        l: [{n: "城区", l: []}]
    }, {n: "长宁区", l: [{n: "城区", l: []}]}, {n: "静安区", l: [{n: "城区", l: []}]}, {
        n: "闸北区",
        l: [{n: "城区", l: []}]
    }, {n: "虹口区", l: [{n: "城区", l: []}]}, {n: "杨浦区", l: [{n: "城区", l: []}]}, {
        n: "宝山区",
        l: [{n: "罗店镇", l: []}, {n: "大场镇", l: []}, {n: "杨行镇", l: []}, {
            n: "月浦镇",
            l: []
        }, {n: "罗泾镇", l: []}, {n: "顾村镇", l: []}, {n: "高境镇", l: []}, {
            n: "庙行镇",
            l: []
        }, {n: "淞南镇", l: []}, {n: "宝山城市工业园区", l: []}, {n: "城区", l: []}]
    }, {
        n: "闵行区",
        l: [{n: "城区", l: []}, {n: "莘庄镇", l: []}, {n: "七宝镇", l: []}, {
            n: "浦江镇",
            l: []
        }, {n: "梅陇镇", l: []}, {n: "虹桥镇", l: []}, {n: "马桥镇", l: []}, {
            n: "吴泾镇",
            l: []
        }, {n: "华漕镇", l: []}, {n: "颛桥镇", l: []}]
    }, {
        n: "嘉定区",
        l: [{n: "城区", l: []}, {n: "南翔镇", l: []}, {n: "马陆镇", l: []}, {
            n: "华亭镇",
            l: []
        }, {n: "江桥镇", l: []}, {n: "菊园新区", l: []}, {n: "安亭镇", l: []}, {
            n: "徐行镇",
            l: []
        }, {n: "外冈镇", l: []}, {n: "嘉定工业区", l: []}]
    }, {
        n: "浦东新区",
        l: [{n: "城区", l: []}, {n: "川沙新镇", l: []}, {n: "高桥镇", l: []}, {
            n: "北蔡镇",
            l: []
        }, {n: "合庆镇", l: []}, {n: "唐镇", l: []}, {n: "曹路镇", l: []}, {
            n: "金桥镇",
            l: []
        }, {n: "高行镇", l: []}, {n: "高东镇", l: []}, {n: "张江镇", l: []}, {
            n: "三林镇",
            l: []
        }, {n: "南汇新城镇", l: []}, {n: "祝桥镇", l: []}, {n: "新场镇", l: []}, {
            n: "惠南镇",
            l: []
        }, {n: "康桥镇", l: []}, {n: "宣桥镇", l: []}, {n: "书院镇", l: []}, {
            n: "大团镇",
            l: []
        }, {n: "周浦镇", l: []}, {n: "芦潮港镇", l: []}, {n: "泥城镇", l: []}, {
            n: "航头镇",
            l: []
        }, {n: "万祥镇", l: []}, {n: "老港镇", l: []}]
    }, {
        n: "青浦区",
        l: [{n: "朱家角镇", l: []}, {n: "赵巷镇", l: []}, {n: "徐泾镇", l: []}, {
            n: "华新镇",
            l: []
        }, {n: "重固镇", l: []}, {n: "白鹤镇", l: []}, {n: "练塘镇", l: []}, {
            n: "金泽镇",
            l: []
        }, {n: "城区", l: []}]
    }, {
        n: "松江区",
        l: [{n: "城区", l: []}, {n: "泗泾镇", l: []}, {n: "佘山镇", l: []}, {
            n: "车墩镇",
            l: []
        }, {n: "新桥镇", l: []}, {n: "洞泾镇", l: []}, {n: "九亭镇", l: []}, {
            n: "泖港镇",
            l: []
        }, {n: "石湖荡镇", l: []}, {n: "新浜镇", l: []}, {n: "叶榭镇", l: []}, {n: "小昆山镇", l: []}]
    }, {
        n: "金山区",
        l: [{n: "城区", l: []}, {n: "金山工业区", l: []}, {n: "朱泾镇", l: []}, {
            n: "枫泾镇",
            l: []
        }, {n: "张堰镇", l: []}, {n: "亭林镇", l: []}, {n: "吕巷镇", l: []}, {
            n: "廊下镇",
            l: []
        }, {n: "金山卫镇", l: []}, {n: "漕泾镇", l: []}, {n: "山阳镇", l: []}]
    }, {
        n: "奉贤区",
        l: [{n: "南桥镇", l: []}, {n: "奉城镇", l: []}, {n: "四团镇", l: []}, {
            n: "柘林镇",
            l: []
        }, {n: "庄行镇", l: []}, {n: "金汇镇", l: []}, {n: "青村镇", l: []}, {n: "海湾镇", l: []}]
    }, {n: "普陀区", l: [{n: "城区", l: []}]}, {
        n: "崇明县",
        l: [{n: "堡镇", l: []}, {n: "庙镇", l: []}, {n: "陈家镇", l: []}, {
            n: "城桥镇",
            l: []
        }, {n: "东平镇", l: []}, {n: "港西镇", l: []}, {n: "港沿镇", l: []}, {
            n: "建设镇",
            l: []
        }, {n: "绿华镇", l: []}, {n: "三星镇", l: []}, {n: "竖新镇", l: []}, {
            n: "向化镇",
            l: []
        }, {n: "新海镇", l: []}, {n: "新河镇", l: []}, {n: "中兴镇", l: []}, {
            n: "长兴乡",
            l: []
        }, {n: "横沙乡", l: []}, {n: "新村乡", l: []}]
    }]
}, {
    n: "天津",
    l: [{n: "东丽区", l: [{n: "全境", l: []}]}, {
        n: "和平区",
        l: [{n: "全境", l: []}]
    }, {n: "河北区", l: [{n: "全境", l: []}]}, {n: "河东区", l: [{n: "全境", l: []}]}, {
        n: "河西区",
        l: [{n: "全境", l: []}]
    }, {n: "红桥区", l: [{n: "全境", l: []}]}, {n: "蓟县", l: [{n: "全境", l: []}]}, {
        n: "静海县",
        l: [{n: "全境", l: []}]
    }, {n: "南开区", l: [{n: "全境", l: []}]}, {n: "塘沽区", l: [{n: "全境", l: []}]}, {
        n: "西青区",
        l: [{n: "其它地区", l: []}, {n: "杨柳青,中北,精武,大寺镇,环外海泰及外环内", l: []}]
    }, {n: "武清区", l: [{n: "杨村镇、下朱庄内", l: []}, {n: "其它地区", l: []}]}, {
        n: "津南区",
        l: [{n: "咸水沽镇、海河教育园，海河科技园", l: []}, {n: "双港，辛庄", l: []}, {n: "其他地区", l: []}]
    }, {n: "汉沽区", l: [{n: "汉沽区街里、汉沽开发区", l: []}, {n: "其它地区", l: []}]}, {
        n: "大港区",
        l: [{n: "大港油田", l: []}, {n: "主城区内", l: []}, {n: "主城区外", l: []}]
    }, {
        n: "北辰区",
        l: [{n: "外环内", l: []}, {n: "外环外双街镇，河北工大新校，屈店工业园", l: []}, {n: "外环外其它地区", l: []}]
    }, {n: "宝坻区", l: [{n: "城关镇、马家店开发区、天宝工业园", l: []}, {n: "其它地区", l: []}]}, {
        n: "宁河县",
        l: [{n: "芦台镇、经济开发区、贸易开发区", l: []}, {n: "其它地区", l: []}]
    }]
}, {
    n: "重庆",
    l: [{
        n: "万州区",
        l: [{n: "陈家坝街道", l: []}, {n: "钟鼓楼街道", l: []}, {n: "周家坝街道", l: []}, {
            n: "百安坝街道",
            l: []
        }, {n: "高笋塘街道", l: []}, {n: "双河口街道", l: []}, {n: "龙都街道", l: []}, {
            n: "牌楼街道",
            l: []
        }, {n: "沙河街道", l: []}, {n: "太白街道", l: []}, {n: "五桥街道", l: []}, {
            n: "白土镇",
            l: []
        }, {n: "白羊镇", l: []}, {n: "大周镇", l: []}, {n: "弹子镇", l: []}, {
            n: "分水镇",
            l: []
        }, {n: "甘宁镇", l: []}, {n: "高峰镇", l: []}, {n: "高梁镇", l: []}, {
            n: "后山镇",
            l: []
        }, {n: "李河镇", l: []}, {n: "龙驹镇", l: []}, {n: "龙沙镇", l: []}, {
            n: "罗田镇",
            l: []
        }, {n: "孙家镇", l: []}, {n: "太安镇", l: []}, {n: "太龙镇", l: []}, {
            n: "天城镇",
            l: []
        }, {n: "武陵镇", l: []}, {n: "响水镇", l: []}, {n: "小周镇", l: []}, {
            n: "新田镇",
            l: []
        }, {n: "新乡镇", l: []}, {n: "熊家镇", l: []}, {n: "余家镇", l: []}, {
            n: "长岭镇",
            l: []
        }, {n: "长坪镇", l: []}, {n: "长滩镇", l: []}, {n: "走马镇", l: []}, {
            n: "瀼渡镇",
            l: []
        }, {n: "茨竹乡", l: []}, {n: "柱山乡", l: []}, {n: "燕山乡", l: []}, {
            n: "溪口乡",
            l: []
        }, {n: "普子乡", l: []}, {n: "地宝乡", l: []}, {n: "铁峰乡", l: []}, {
            n: "黄柏乡",
            l: []
        }, {n: "九池乡", l: []}, {n: "梨树乡", l: []}, {n: "郭村乡", l: []}, {n: "恒合乡", l: []}]
    }, {
        n: "涪陵区",
        l: [{n: "荔枝街道", l: []}, {n: "敦仁街道", l: []}, {n: "江北街道", l: []}, {
            n: "江东街道",
            l: []
        }, {n: "崇义街道", l: []}, {n: "李渡镇", l: []}, {n: "白涛镇", l: []}, {
            n: "百胜镇",
            l: []
        }, {n: "堡子镇", l: []}, {n: "焦石镇", l: []}, {n: "蔺市镇", l: []}, {
            n: "龙桥镇",
            l: []
        }, {n: "龙潭镇", l: []}, {n: "马武镇", l: []}, {n: "南沱镇", l: []}, {
            n: "青羊镇",
            l: []
        }, {n: "清溪镇", l: []}, {n: "石沱镇", l: []}, {n: "新妙镇", l: []}, {
            n: "义和镇",
            l: []
        }, {n: "增福乡", l: []}, {n: "珍溪镇", l: []}, {n: "镇安镇", l: []}, {
            n: "致韩镇",
            l: []
        }, {n: "土地坡乡", l: []}, {n: "武陵山乡", l: []}, {n: "中峰乡", l: []}, {
            n: "梓里乡",
            l: []
        }, {n: "丛林乡", l: []}, {n: "大木乡", l: []}, {n: "惠民乡", l: []}, {
            n: "酒店乡",
            l: []
        }, {n: "聚宝乡", l: []}, {n: "卷洞乡", l: []}, {n: "两汇乡", l: []}, {
            n: "罗云乡",
            l: []
        }, {n: "明家乡", l: []}, {n: "仁义乡", l: []}, {n: "山窝乡", l: []}, {
            n: "石和乡",
            l: []
        }, {n: "石龙乡", l: []}, {n: "太和乡", l: []}, {n: "天台乡", l: []}, {
            n: "同乐乡",
            l: []
        }, {n: "新村乡", l: []}]
    }, {
        n: "梁平县",
        l: [{n: "梁山镇", l: []}, {n: "柏家镇", l: []}, {n: "碧山镇", l: []}, {
            n: "大观镇",
            l: []
        }, {n: "福禄镇", l: []}, {n: "合兴镇", l: []}, {n: "和林镇", l: []}, {
            n: "虎城镇",
            l: []
        }, {n: "回龙镇", l: []}, {n: "金带镇", l: []}, {n: "聚奎镇", l: []}, {
            n: "礼让镇",
            l: []
        }, {n: "龙门镇", l: []}, {n: "明达镇", l: []}, {n: "蟠龙镇", l: []}, {
            n: "屏锦镇",
            l: []
        }, {n: "仁贤镇", l: []}, {n: "石安镇", l: []}, {n: "文化镇", l: []}, {
            n: "新盛镇",
            l: []
        }, {n: "荫平镇", l: []}, {n: "袁驿镇", l: []}, {n: "云龙镇", l: []}, {
            n: "竹山镇",
            l: []
        }, {n: "安胜乡", l: []}, {n: "铁门乡", l: []}, {n: "紫照乡", l: []}, {
            n: "曲水乡",
            l: []
        }, {n: "龙胜乡", l: []}, {n: "城北乡", l: []}, {n: "城东乡", l: []}, {
            n: "复平乡",
            l: []
        }, {n: "县城内", l: []}]
    }, {
        n: "南川区",
        l: [{n: "东城街道", l: []}, {n: "南城街道", l: []}, {n: "西城街道", l: []}, {
            n: "太平场镇",
            l: []
        }, {n: "大观镇", l: []}, {n: "大有镇", l: []}, {n: "合溪镇", l: []}, {
            n: "金山镇",
            l: []
        }, {n: "鸣玉镇", l: []}, {n: "南平镇", l: []}, {n: "三泉镇", l: []}, {
            n: "神童镇",
            l: []
        }, {n: "石墙镇", l: []}, {n: "水江镇", l: []}, {n: "头渡镇", l: []}, {
            n: "兴隆镇",
            l: []
        }, {n: "冷水关乡", l: []}, {n: "德隆乡", l: []}, {n: "峰岩乡", l: []}, {
            n: "福寿乡",
            l: []
        }, {n: "古花乡", l: []}, {n: "河图乡", l: []}, {n: "民主乡", l: []}, {
            n: "木凉乡",
            l: []
        }, {n: "乾丰乡", l: []}, {n: "庆元乡", l: []}, {n: "石莲乡", l: []}, {
            n: "石溪乡",
            l: []
        }, {n: "铁村乡", l: []}, {n: "土溪乡", l: []}, {n: "鱼泉乡", l: []}, {n: "中桥乡", l: []}]
    }, {
        n: "潼南县",
        l: [{n: "桂林街道", l: []}, {n: "梓潼街道", l: []}, {n: "柏梓镇", l: []}, {
            n: "宝龙镇",
            l: []
        }, {n: "崇龛镇", l: []}, {n: "古溪镇", l: []}, {n: "龙形镇", l: []}, {
            n: "米心镇",
            l: []
        }, {n: "群力镇", l: []}, {n: "上和镇", l: []}, {n: "双江镇", l: []}, {
            n: "太安镇",
            l: []
        }, {n: "塘坝镇", l: []}, {n: "卧佛镇", l: []}, {n: "五桂镇", l: []}, {
            n: "小渡镇",
            l: []
        }, {n: "新胜镇", l: []}, {n: "玉溪镇", l: []}, {n: "别口乡", l: []}, {
            n: "田家乡",
            l: []
        }, {n: "寿桥乡", l: []}, {n: "县城内", l: []}]
    }, {
        n: "大足区",
        l: [{n: "龙岗街道", l: []}, {n: "棠香街道", l: []}, {n: "龙滩子街道", l: []}, {
            n: "龙水镇",
            l: []
        }, {n: "智凤镇", l: []}, {n: "宝顶镇", l: []}, {n: "中敖镇", l: []}, {
            n: "三驱镇",
            l: []
        }, {n: "宝兴镇", l: []}, {n: "玉龙镇", l: []}, {n: "石马镇", l: []}, {
            n: "拾万镇",
            l: []
        }, {n: "回龙镇", l: []}, {n: "金山镇", l: []}, {n: "万古镇", l: []}, {
            n: "国梁镇",
            l: []
        }, {n: "雍溪镇", l: []}, {n: "珠溪镇", l: []}, {n: "龙石镇", l: []}, {
            n: "邮亭镇",
            l: []
        }, {n: "铁山镇", l: []}, {n: "高升镇", l: []}, {n: "季家镇", l: []}, {
            n: "古龙镇",
            l: []
        }, {n: "高坪镇", l: []}, {n: "双路镇", l: []}, {n: "通桥镇", l: []}]
    }, {
        n: "黔江区",
        l: [{n: "城西街道", l: []}, {n: "城东街道", l: []}, {n: "城南街道", l: []}, {
            n: "正阳街道",
            l: []
        }, {n: "舟白街道", l: []}, {n: "阿蓬江镇", l: []}, {n: "小南海镇", l: []}, {
            n: "鹅池镇",
            l: []
        }, {n: "冯家镇", l: []}, {n: "黑溪镇", l: []}, {n: "黄溪镇", l: []}, {
            n: "金溪镇",
            l: []
        }, {n: "黎水镇", l: []}, {n: "邻鄂镇", l: []}, {n: "马喇镇", l: []}, {
            n: "石会镇",
            l: []
        }, {n: "石家镇", l: []}, {n: "濯水镇", l: []}, {n: "白石乡", l: []}, {
            n: "白土乡",
            l: []
        }, {n: "金洞乡", l: []}, {n: "蓬东乡", l: []}, {n: "沙坝乡", l: []}, {
            n: "杉岭乡",
            l: []
        }, {n: "水市乡", l: []}, {n: "水田乡", l: []}, {n: "太极乡", l: []}, {
            n: "五里乡",
            l: []
        }, {n: "新华乡", l: []}, {n: "中塘乡", l: []}]
    }, {
        n: "武隆县",
        l: [{n: "仙女山镇", l: []}, {n: "巷口镇", l: []}, {n: "白马镇", l: []}, {
            n: "火炉镇",
            l: []
        }, {n: "江口镇", l: []}, {n: "平桥镇", l: []}, {n: "桐梓镇", l: []}, {
            n: "土坎镇",
            l: []
        }, {n: "鸭江镇", l: []}, {n: "羊角镇", l: []}, {n: "长坝镇", l: []}, {
            n: "白云乡",
            l: []
        }, {n: "沧沟乡", l: []}, {n: "凤来乡", l: []}, {n: "浩口乡", l: []}, {
            n: "和顺乡",
            l: []
        }, {n: "后坪乡", l: []}, {n: "黄莺乡", l: []}, {n: "接龙乡", l: []}, {
            n: "庙垭乡",
            l: []
        }, {n: "石桥乡", l: []}, {n: "双河乡", l: []}, {n: "铁矿乡", l: []}, {
            n: "土地乡",
            l: []
        }, {n: "文复乡", l: []}, {n: "赵家乡", l: []}, {n: "县城内", l: []}]
    }, {
        n: "丰都县",
        l: [{n: "三合街道", l: []}, {n: "南天湖镇", l: []}, {n: "许明寺镇", l: []}, {
            n: "包鸾镇",
            l: []
        }, {n: "董家镇", l: []}, {n: "高家镇", l: []}, {n: "虎威镇", l: []}, {
            n: "江池镇",
            l: []
        }, {n: "龙河镇", l: []}, {n: "名山镇", l: []}, {n: "三元镇", l: []}, {
            n: "社坛镇",
            l: []
        }, {n: "十直镇", l: []}, {n: "树人镇", l: []}, {n: "双路镇", l: []}, {
            n: "武平镇",
            l: []
        }, {n: "兴义镇", l: []}, {n: "湛普镇", l: []}, {n: "镇江镇", l: []}, {
            n: "太平坝乡",
            l: []
        }, {n: "双龙场乡", l: []}, {n: "保合乡", l: []}, {n: "崇兴乡", l: []}, {
            n: "都督乡",
            l: []
        }, {n: "暨龙乡", l: []}, {n: "栗子乡", l: []}, {n: "龙孔乡", l: []}, {
            n: "青龙乡",
            l: []
        }, {n: "仁沙乡", l: []}, {n: "三坝乡", l: []}, {n: "三建乡", l: []}, {n: "县城内", l: []}]
    }, {
        n: "奉节县",
        l: [{n: "永安镇", l: []}, {n: "白帝镇", l: []}, {n: "草堂镇", l: []}, {
            n: "大树镇",
            l: []
        }, {n: "汾河镇", l: []}, {n: "公平镇", l: []}, {n: "甲高镇", l: []}, {
            n: "康乐镇",
            l: []
        }, {n: "青龙镇", l: []}, {n: "吐祥镇", l: []}, {n: "新民镇", l: []}, {
            n: "兴隆镇",
            l: []
        }, {n: "羊市镇", l: []}, {n: "朱衣镇", l: []}, {n: "竹园镇", l: []}, {
            n: "安坪乡",
            l: []
        }, {n: "冯坪乡", l: []}, {n: "鹤峰乡", l: []}, {n: "红土乡", l: []}, {
            n: "康坪乡",
            l: []
        }, {n: "龙桥乡", l: []}, {n: "平安乡", l: []}, {n: "石岗乡", l: []}, {
            n: "太和乡",
            l: []
        }, {n: "五马乡", l: []}, {n: "新政乡", l: []}, {n: "岩湾乡", l: []}, {
            n: "云雾乡",
            l: []
        }, {n: "长安乡", l: []}, {n: "县城内", l: []}, {n: "永乐镇", l: []}]
    }, {
        n: "开县",
        l: [{n: "汉丰街道", l: []}, {n: "白鹤街道", l: []}, {n: "丰乐街道", l: []}, {
            n: "镇东街道",
            l: []
        }, {n: "九龙山镇", l: []}, {n: "大进镇", l: []}, {n: "敦好镇", l: []}, {
            n: "高桥镇",
            l: []
        }, {n: "郭家镇", l: []}, {n: "和谦镇", l: []}, {n: "河堰镇", l: []}, {
            n: "厚坝镇",
            l: []
        }, {n: "临江镇", l: []}, {n: "南门镇", l: []}, {n: "南雅镇", l: []}, {
            n: "渠口镇",
            l: []
        }, {n: "铁桥镇", l: []}, {n: "温泉镇", l: []}, {n: "义和镇", l: []}, {
            n: "长沙镇",
            l: []
        }, {n: "赵家镇", l: []}, {n: "镇安镇", l: []}, {n: "中和镇", l: []}, {
            n: "竹溪镇",
            l: []
        }, {n: "三汇口乡", l: []}, {n: "白桥乡", l: []}, {n: "大德乡", l: []}, {
            n: "关面乡",
            l: []
        }, {n: "金峰乡", l: []}, {n: "麻柳乡", l: []}, {n: "满月乡", l: []}, {
            n: "谭家乡",
            l: []
        }, {n: "天和乡", l: []}, {n: "巫山镇", l: []}, {n: "五通乡", l: []}, {
            n: "紫水乡",
            l: []
        }, {n: "县城内", l: []}, {n: "云枫街道", l: []}, {n: "文峰街道", l: []}, {
            n: "白桥镇",
            l: []
        }, {n: "大德镇", l: []}, {n: "金峰镇", l: []}, {n: "谭家镇", l: []}, {
            n: "天和镇",
            l: []
        }, {n: "白泉乡", l: []}, {n: "岳溪镇", l: []}]
    }, {
        n: "云阳县",
        l: [{n: "双江街道", l: []}, {n: "青龙街道", l: []}, {n: "云阳镇", l: []}, {
            n: "巴阳镇",
            l: []
        }, {n: "凤鸣镇", l: []}, {n: "高阳镇", l: []}, {n: "故陵镇", l: []}, {
            n: "红狮镇",
            l: []
        }, {n: "黄石镇", l: []}, {n: "江口镇", l: []}, {n: "龙角镇", l: []}, {
            n: "路阳镇",
            l: []
        }, {n: "南溪镇", l: []}, {n: "农坝镇", l: []}, {n: "盘龙镇", l: []}, {
            n: "平安镇",
            l: []
        }, {n: "渠马镇", l: []}, {n: "人和镇", l: []}, {n: "桑坪镇", l: []}, {
            n: "沙市镇",
            l: []
        }, {n: "双土镇", l: []}, {n: "鱼泉镇", l: []}, {n: "云安镇", l: []}, {
            n: "洞鹿乡",
            l: []
        }, {n: "后叶乡", l: []}, {n: "龙洞乡", l: []}, {n: "毛坝乡", l: []}, {
            n: "泥溪乡",
            l: []
        }, {n: "票草乡", l: []}, {n: "普安乡", l: []}, {n: "栖霞乡", l: []}, {
            n: "清水乡",
            l: []
        }, {n: "上坝乡", l: []}, {n: "石门乡", l: []}, {n: "双龙乡", l: []}, {
            n: "水口乡",
            l: []
        }, {n: "外郎乡", l: []}, {n: "新津乡", l: []}, {n: "堰坪乡", l: []}, {
            n: "养鹿乡",
            l: []
        }, {n: "耀灵乡", l: []}, {n: "云硐乡", l: []}, {n: "县城内", l: []}]
    }, {
        n: "忠县",
        l: [{n: "忠州镇", l: []}, {n: "拔山镇", l: []}, {n: "白石镇", l: []}, {
            n: "东溪镇",
            l: []
        }, {n: "复兴镇", l: []}, {n: "官坝镇", l: []}, {n: "花桥镇", l: []}, {
            n: "黄金镇",
            l: []
        }, {n: "金鸡镇", l: []}, {n: "马灌镇", l: []}, {n: "任家镇", l: []}, {
            n: "汝溪镇",
            l: []
        }, {n: "三汇镇", l: []}, {n: "石宝镇", l: []}, {n: "石黄镇", l: []}, {
            n: "双桂镇",
            l: []
        }, {n: "乌杨镇", l: []}, {n: "新生镇", l: []}, {n: "洋渡镇", l: []}, {
            n: "野鹤镇",
            l: []
        }, {n: "永丰镇", l: []}, {n: "金声乡", l: []}, {n: "磨子乡", l: []}, {
            n: "善广乡",
            l: []
        }, {n: "石子乡", l: []}, {n: "涂井乡", l: []}, {n: "兴峰乡", l: []}, {
            n: "新立镇",
            l: []
        }, {n: "县城内", l: []}]
    }, {
        n: "巫溪县",
        l: [{n: "城厢镇", l: []}, {n: "凤凰镇", l: []}, {n: "古路镇", l: []}, {
            n: "尖山镇",
            l: []
        }, {n: "宁厂镇", l: []}, {n: "上磺镇", l: []}, {n: "文峰镇", l: []}, {
            n: "下堡镇",
            l: []
        }, {n: "徐家镇", l: []}, {n: "朝阳洞乡", l: []}, {n: "大河乡", l: []}, {
            n: "峰灵乡",
            l: []
        }, {n: "花台乡", l: []}, {n: "兰英乡", l: []}, {n: "菱角乡", l: []}, {
            n: "蒲莲乡",
            l: []
        }, {n: "胜利乡", l: []}, {n: "双阳乡", l: []}, {n: "塘坊乡", l: []}, {
            n: "天星乡",
            l: []
        }, {n: "天元乡", l: []}, {n: "田坝乡", l: []}, {n: "通城乡", l: []}, {
            n: "土城乡",
            l: []
        }, {n: "乌龙乡", l: []}, {n: "鱼鳞乡", l: []}, {n: "长桂乡", l: []}, {
            n: "中岗乡",
            l: []
        }, {n: "中梁乡", l: []}, {n: "县城内", l: []}]
    }, {
        n: "巫山县",
        l: [{n: "巫峡镇", l: []}, {n: "大昌镇", l: []}, {n: "福田镇", l: []}, {
            n: "官渡镇",
            l: []
        }, {n: "官阳镇", l: []}, {n: "龙溪镇", l: []}, {n: "骡坪镇", l: []}, {
            n: "庙堂乡",
            l: []
        }, {n: "庙宇镇", l: []}, {n: "双龙镇", l: []}, {n: "铜鼓镇", l: []}, {
            n: "抱龙镇",
            l: []
        }, {n: "大溪乡", l: []}, {n: "当阳乡", l: []}, {n: "邓家乡", l: []}, {
            n: "笃坪乡",
            l: []
        }, {n: "红椿乡", l: []}, {n: "建平乡", l: []}, {n: "金坪乡", l: []}, {
            n: "两坪乡",
            l: []
        }, {n: "龙井乡", l: []}, {n: "培石乡", l: []}, {n: "平河乡", l: []}, {
            n: "曲尺乡",
            l: []
        }, {n: "三溪乡", l: []}, {n: "竹贤乡", l: []}, {n: "县城内", l: []}]
    }, {
        n: "石柱县",
        l: [{n: "南宾镇", l: []}, {n: "黄水镇", l: []}, {n: "临溪镇", l: []}, {
            n: "龙沙镇",
            l: []
        }, {n: "马武镇", l: []}, {n: "沙子镇", l: []}, {n: "王场镇", l: []}, {
            n: "西沱镇",
            l: []
        }, {n: "下路镇", l: []}, {n: "沿溪镇", l: []}, {n: "渔池镇", l: []}, {
            n: "悦崃镇",
            l: []
        }, {n: "大歇乡", l: []}, {n: "枫木乡", l: []}, {n: "河嘴乡", l: []}, {
            n: "黄鹤乡",
            l: []
        }, {n: "金铃乡", l: []}, {n: "金竹乡", l: []}, {n: "冷水乡", l: []}, {
            n: "黎场乡",
            l: []
        }, {n: "六塘乡", l: []}, {n: "龙潭乡", l: []}, {n: "桥头乡", l: []}, {
            n: "三河乡",
            l: []
        }, {n: "三益乡", l: []}, {n: "石家乡", l: []}, {n: "万朝乡", l: []}, {
            n: "王家乡",
            l: []
        }, {n: "洗新乡", l: []}, {n: "新乐乡", l: []}, {n: "中益乡", l: []}, {n: "县城内", l: []}]
    }, {
        n: "彭水县",
        l: [{n: "汉葭街道", l: []}, {n: "保家镇", l: []}, {n: "高谷镇", l: []}, {
            n: "黄家镇",
            l: []
        }, {n: "连湖镇", l: []}, {n: "龙射镇", l: []}, {n: "鹿角镇", l: []}, {
            n: "普子镇",
            l: []
        }, {n: "桑柘镇", l: []}, {n: "万足镇", l: []}, {n: "郁山镇", l: []}, {
            n: "梅子垭乡",
            l: []
        }, {n: "鞍子乡", l: []}, {n: "大垭乡", l: []}, {n: "棣棠乡", l: []}, {
            n: "靛水乡",
            l: []
        }, {n: "朗溪乡", l: []}, {n: "联合乡", l: []}, {n: "龙塘乡", l: []}, {
            n: "龙溪乡",
            l: []
        }, {n: "芦塘乡", l: []}, {n: "鹿鸣乡", l: []}, {n: "平安乡", l: []}, {
            n: "迁乔乡",
            l: []
        }, {n: "乔梓乡", l: []}, {n: "润溪乡", l: []}, {n: "三义乡", l: []}, {
            n: "善感乡",
            l: []
        }, {n: "石柳乡", l: []}, {n: "石盘乡", l: []}, {n: "双龙乡", l: []}, {
            n: "太原乡",
            l: []
        }, {n: "桐楼乡", l: []}, {n: "小厂乡", l: []}, {n: "新田乡", l: []}, {
            n: "岩东乡",
            l: []
        }, {n: "长滩乡", l: []}, {n: "诸佛乡", l: []}, {n: "走马乡", l: []}, {n: "县城内", l: []}]
    }, {
        n: "垫江县",
        l: [{n: "桂溪镇", l: []}, {n: "澄溪镇", l: []}, {n: "高安镇", l: []}, {
            n: "高峰镇",
            l: []
        }, {n: "鹤游镇", l: []}, {n: "普顺镇", l: []}, {n: "沙坪镇", l: []}, {
            n: "太平镇",
            l: []
        }, {n: "五洞镇", l: []}, {n: "新民镇", l: []}, {n: "砚台镇", l: []}, {
            n: "永安镇",
            l: []
        }, {n: "周嘉镇", l: []}, {n: "白家乡", l: []}, {n: "包家乡", l: []}, {
            n: "曹回乡",
            l: []
        }, {n: "大石乡", l: []}, {n: "杠家乡", l: []}, {n: "黄沙乡", l: []}, {
            n: "裴兴乡",
            l: []
        }, {n: "三溪乡", l: []}, {n: "沙河乡", l: []}, {n: "永平乡", l: []}, {
            n: "长龙乡",
            l: []
        }, {n: "坪山镇", l: []}, {n: "县城内", l: []}]
    }, {
        n: "酉阳县",
        l: [{n: "钟多镇", l: []}, {n: "苍岭镇", l: []}, {n: "车田乡", l: []}, {
            n: "大溪镇",
            l: []
        }, {n: "丁市镇", l: []}, {n: "泔溪镇", l: []}, {n: "龚滩镇", l: []}, {
            n: "黑水镇",
            l: []
        }, {n: "后溪镇", l: []}, {n: "李溪镇", l: []}, {n: "龙潭镇", l: []}, {
            n: "麻旺镇",
            l: []
        }, {n: "小河镇", l: []}, {n: "兴隆镇", l: []}, {n: "酉酬镇", l: []}, {
            n: "南腰界乡",
            l: []
        }, {n: "后坪坝乡", l: []}, {n: "板溪乡", l: []}, {n: "官清乡", l: []}, {
            n: "花田乡",
            l: []
        }, {n: "江丰乡", l: []}, {n: "可大乡", l: []}, {n: "浪坪乡", l: []}, {
            n: "两罾乡",
            l: []
        }, {n: "毛坝乡", l: []}, {n: "庙溪乡", l: []}, {n: "木叶乡", l: []}, {
            n: "楠木乡",
            l: []
        }, {n: "偏柏乡", l: []}, {n: "清泉乡", l: []}, {n: "双泉乡", l: []}, {
            n: "天馆乡",
            l: []
        }, {n: "铜鼓乡", l: []}, {n: "涂市乡", l: []}, {n: "万木乡", l: []}, {
            n: "五福乡",
            l: []
        }, {n: "宜居乡", l: []}, {n: "腴地乡", l: []}, {n: "板桥乡", l: []}, {n: "县城内", l: []}]
    }, {
        n: "秀山县",
        l: [{n: "清溪场镇", l: []}, {n: "中和镇", l: []}, {n: "隘口镇", l: []}, {
            n: "峨溶镇",
            l: []
        }, {n: "官庄镇", l: []}, {n: "洪安镇", l: []}, {n: "兰桥镇", l: []}, {
            n: "龙池镇",
            l: []
        }, {n: "梅江镇", l: []}, {n: "平凯镇", l: []}, {n: "溶溪镇", l: []}, {
            n: "石堤镇",
            l: []
        }, {n: "石耶镇", l: []}, {n: "雅江镇", l: []}, {n: "巴家乡", l: []}, {
            n: "保安乡",
            l: []
        }, {n: "岑溪乡", l: []}, {n: "大溪乡", l: []}, {n: "干川乡", l: []}, {
            n: "膏田乡",
            l: []
        }, {n: "官舟乡", l: []}, {n: "海洋乡", l: []}, {n: "里仁乡", l: []}, {
            n: "妙泉乡",
            l: []
        }, {n: "平马乡", l: []}, {n: "宋农乡", l: []}, {n: "溪口乡", l: []}, {
            n: "孝溪乡",
            l: []
        }, {n: "涌洞乡", l: []}, {n: "中平乡", l: []}, {n: "钟灵乡", l: []}, {n: "县城内", l: []}]
    }, {
        n: "城口县",
        l: [{n: "葛城镇", l: []}, {n: "巴山镇", l: []}, {n: "高观镇", l: []}, {
            n: "庙坝镇",
            l: []
        }, {n: "明通镇", l: []}, {n: "坪坝镇", l: []}, {n: "修齐镇", l: []}, {
            n: "北屏乡",
            l: []
        }, {n: "东安乡", l: []}, {n: "高楠乡", l: []}, {n: "高燕乡", l: []}, {
            n: "河鱼乡",
            l: []
        }, {n: "厚坪乡", l: []}, {n: "鸡鸣乡", l: []}, {n: "岚天乡", l: []}, {
            n: "蓼子乡",
            l: []
        }, {n: "龙田乡", l: []}, {n: "明中乡", l: []}, {n: "双河乡", l: []}, {
            n: "咸宜乡",
            l: []
        }, {n: "沿河乡", l: []}, {n: "治平乡", l: []}, {n: "周溪乡", l: []}, {
            n: "左岚乡",
            l: []
        }, {n: "县城内", l: []}]
    }, {
        n: "璧山县",
        l: [{n: "县城内", l: []}, {n: "璧城街道", l: []}, {n: "璧泉街道", l: []}, {
            n: "青杠街道",
            l: []
        }, {n: "来凤街道", l: []}, {n: "丁家街道", l: []}, {n: "大路街道", l: []}, {
            n: "八塘镇",
            l: []
        }, {n: "七塘镇", l: []}, {n: "河边镇", l: []}, {n: "福禄镇", l: []}, {
            n: "大兴镇",
            l: []
        }, {n: "正兴镇", l: []}, {n: "广普镇", l: []}, {n: "三合镇", l: []}, {n: "健龙镇", l: []}]
    }, {
        n: "荣昌县",
        l: [{n: "县城内", l: []}, {n: "昌元街道", l: []}, {n: "昌洲街道", l: []}, {
            n: "广顺街道",
            l: []
        }, {n: "安富街道", l: []}, {n: "峰高街道", l: []}, {n: "双河街道", l: []}, {
            n: "直升镇",
            l: []
        }, {n: "路孔镇", l: []}, {n: "清江镇", l: []}, {n: "仁义镇", l: []}, {
            n: "河包镇",
            l: []
        }, {n: "古昌镇", l: []}, {n: "吴家镇", l: []}, {n: "观胜镇", l: []}, {
            n: "铜鼓镇",
            l: []
        }, {n: "清流镇", l: []}, {n: "盘龙镇", l: []}, {n: "远觉镇", l: []}, {
            n: "清升镇",
            l: []
        }, {n: "荣隆镇", l: []}, {n: "龙集镇", l: []}]
    }, {
        n: "铜梁县",
        l: [{n: "县城内", l: []}, {n: "巴川街道", l: []}, {n: "东城街道", l: []}, {
            n: "南城街道",
            l: []
        }, {n: "土桥镇", l: []}, {n: "二坪镇", l: []}, {n: "水口镇", l: []}, {
            n: "安居镇",
            l: []
        }, {n: "白羊镇", l: []}, {n: "平滩镇", l: []}, {n: "石鱼镇", l: []}, {
            n: "福果镇",
            l: []
        }, {n: "维新镇", l: []}, {n: "高楼镇", l: []}, {n: "大庙镇", l: []}, {
            n: "围龙镇",
            l: []
        }, {n: "华兴镇", l: []}, {n: "永嘉镇", l: []}, {n: "安溪镇", l: []}, {
            n: "西河镇",
            l: []
        }, {n: "太平镇", l: []}, {n: "旧县镇", l: []}, {n: "虎峰镇", l: []}, {
            n: "少云镇",
            l: []
        }, {n: "蒲吕镇", l: []}, {n: "侣俸镇", l: []}, {n: "小林乡", l: []}, {
            n: "双山乡",
            l: []
        }, {n: "庆隆乡", l: []}]
    }, {
        n: "合川区",
        l: [{n: "南津街道", l: []}, {n: "合阳城街道", l: []}, {n: "钓鱼城街道", l: []}, {
            n: "草街街道",
            l: []
        }, {n: "盐井街道", l: []}, {n: "云门街道", l: []}, {n: "大石街道", l: []}, {
            n: "沙鱼镇",
            l: []
        }, {n: "官渡镇", l: []}, {n: "涞滩镇", l: []}, {n: "肖家镇", l: []}, {
            n: "古楼镇",
            l: []
        }, {n: "三庙镇", l: []}, {n: "二郎镇", l: []}, {n: "龙凤镇", l: []}, {
            n: "隆兴镇",
            l: []
        }, {n: "铜溪镇", l: []}, {n: "双凤镇", l: []}, {n: "狮滩镇", l: []}, {
            n: "清平镇",
            l: []
        }, {n: "土场镇", l: []}, {n: "小沔镇", l: []}, {n: "三汇镇", l: []}, {
            n: "香龙镇",
            l: []
        }, {n: "钱塘镇", l: []}, {n: "龙市镇", l: []}, {n: "燕窝镇", l: []}, {
            n: "太和镇",
            l: []
        }, {n: "渭沱镇", l: []}, {n: "双槐镇", l: []}]
    }, {
        n: "巴南区",
        l: [{n: "鱼洞街道", l: []}, {n: "花溪街道", l: []}, {n: "龙洲湾街道", l: []}, {
            n: "李家沱街道",
            l: []
        }, {n: "南泉街道", l: []}, {n: "一品街道", l: []}, {n: "南彭街道", l: []}, {
            n: "惠民街道",
            l: []
        }, {n: "麻柳嘴镇", l: []}, {n: "天星寺镇", l: []}, {n: "双河口镇", l: []}, {
            n: "界石镇",
            l: []
        }, {n: "安澜镇", l: []}, {n: "跳石镇", l: []}, {n: "木洞镇", l: []}, {
            n: "丰盛镇",
            l: []
        }, {n: "二圣镇", l: []}, {n: "东泉镇", l: []}, {n: "姜家镇", l: []}, {
            n: "接龙镇",
            l: []
        }, {n: "石滩镇", l: []}, {n: "石龙镇", l: []}]
    }, {
        n: "北碚区",
        l: [{n: "北温泉街道", l: []}, {n: "龙凤桥街道", l: []}, {n: "天生街道", l: []}, {
            n: "东阳街道",
            l: []
        }, {n: "朝阳街道", l: []}, {n: "蔡家岗镇", l: []}, {n: "童家溪镇", l: []}, {
            n: "施家梁镇",
            l: []
        }, {n: "金刀峡镇", l: []}, {n: "澄江镇", l: []}, {n: "水土镇", l: []}, {
            n: "歇马镇",
            l: []
        }, {n: "天府镇", l: []}, {n: "复兴镇", l: []}, {n: "静观镇", l: []}, {
            n: "柳荫镇",
            l: []
        }, {n: "三圣镇", l: []}]
    }, {
        n: "江津区",
        l: [{n: "几江街道", l: []}, {n: "德感街道", l: []}, {n: "鼎山街道", l: []}, {
            n: "双福街道",
            l: []
        }, {n: "四面山镇", l: []}, {n: "支坪镇", l: []}, {n: "白沙镇", l: []}, {
            n: "珞璜镇",
            l: []
        }, {n: "柏林镇", l: []}, {n: "蔡家镇", l: []}, {n: "慈云镇", l: []}, {
            n: "杜市镇",
            l: []
        }, {n: "广兴镇", l: []}, {n: "嘉平镇", l: []}, {n: "贾嗣镇", l: []}, {
            n: "李市镇",
            l: []
        }, {n: "龙华镇", l: []}, {n: "石蟆镇", l: []}, {n: "石门镇", l: []}, {
            n: "塘河镇",
            l: []
        }, {n: "吴滩镇", l: []}, {n: "西湖镇", l: []}, {n: "夏坝镇", l: []}, {
            n: "先锋镇",
            l: []
        }, {n: "永兴镇", l: []}, {n: "油溪镇", l: []}, {n: "中山镇", l: []}, {n: "朱杨镇", l: []}]
    }, {
        n: "渝北区",
        l: [{n: "双凤桥街道", l: []}, {n: "双龙湖街道", l: []}, {n: "大竹林街道", l: []}, {
            n: "天宫殿街道",
            l: []
        }, {n: "翠云街道", l: []}, {n: "人和街道", l: []}, {n: "鸳鸯街道", l: []}, {
            n: "礼嘉街道",
            l: []
        }, {n: "回兴街道", l: []}, {n: "龙山街道", l: []}, {n: "龙塔街道", l: []}, {
            n: "龙溪街道",
            l: []
        }, {n: "两路街道", l: []}, {n: "王家街道", l: []}, {n: "悦来街道", l: []}, {
            n: "玉峰山镇",
            l: []
        }, {n: "茨竹镇", l: []}, {n: "大盛镇", l: []}, {n: "大塆镇", l: []}, {
            n: "古路镇",
            l: []
        }, {n: "龙兴镇", l: []}, {n: "洛碛镇", l: []}, {n: "木耳镇", l: []}, {
            n: "石船镇",
            l: []
        }, {n: "统景镇", l: []}, {n: "兴隆镇", l: []}]
    }, {
        n: "长寿区",
        l: [{n: "凤城街道", l: []}, {n: "晏家街道", l: []}, {n: "渡舟街道", l: []}, {
            n: "江南街道",
            l: []
        }, {n: "长寿湖镇", l: []}, {n: "邻封镇", l: []}, {n: "但渡镇", l: []}, {
            n: "云集镇",
            l: []
        }, {n: "双龙镇", l: []}, {n: "龙河镇", l: []}, {n: "石堰镇", l: []}, {
            n: "云台镇",
            l: []
        }, {n: "海棠镇", l: []}, {n: "葛兰镇", l: []}, {n: "新市镇", l: []}, {
            n: "八颗镇",
            l: []
        }, {n: "洪湖镇", l: []}, {n: "万顺镇", l: []}]
    }, {
        n: "永川区",
        l: [{n: "中山路街道", l: []}, {n: "胜利路街道", l: []}, {n: "南大街街道", l: []}, {
            n: "卫星湖街道",
            l: []
        }, {n: "茶山竹海街道", l: []}, {n: "大安街道", l: []}, {n: "陈食街道", l: []}, {
            n: "板桥镇",
            l: []
        }, {n: "宝峰镇", l: []}, {n: "临江镇", l: []}, {n: "红炉镇", l: []}, {
            n: "吉安镇",
            l: []
        }, {n: "金龙镇", l: []}, {n: "来苏镇", l: []}, {n: "青峰镇", l: []}, {
            n: "三教镇",
            l: []
        }, {n: "双石镇", l: []}, {n: "松溉镇", l: []}, {n: "五间镇", l: []}, {
            n: "仙龙镇",
            l: []
        }, {n: "永荣镇", l: []}, {n: "朱沱镇", l: []}, {n: "何埂镇", l: []}]
    }, {
        n: "江北区",
        l: [{n: "内环以内", l: []}, {n: "寸滩街道", l: []}, {n: "郭家沱街道", l: []}, {
            n: "铁山坪街道",
            l: []
        }, {n: "鱼嘴镇", l: []}, {n: "复盛镇", l: []}, {n: "五宝镇", l: []}, {n: "大石坝街道", l: []}]
    }, {
        n: "南岸区",
        l: [{n: "内环以内", l: []}, {n: "茶园新区", l: []}, {n: "鸡冠石镇", l: []}, {
            n: "长生桥镇",
            l: []
        }, {n: "峡口镇", l: []}, {n: "广阳镇", l: []}, {n: "迎龙镇", l: []}, {n: "海棠溪街道", l: []}]
    }, {
        n: "九龙坡区",
        l: [{n: "内环以内", l: []}, {n: "白市驿镇", l: []}, {n: "铜罐驿镇", l: []}, {
            n: "华岩镇",
            l: []
        }, {n: "巴福镇", l: []}, {n: "含谷镇", l: []}, {n: "金凤镇", l: []}, {
            n: "石板镇",
            l: []
        }, {n: "陶家镇", l: []}, {n: "西彭镇", l: []}, {n: "走马镇", l: []}]
    }, {
        n: "沙坪坝区",
        l: [{n: "内环以内", l: []}, {n: "陈家桥镇", l: []}, {n: "歌乐山镇", l: []}, {
            n: "青木关镇",
            l: []
        }, {n: "回龙坝镇", l: []}, {n: "大学城", l: []}, {n: "虎溪镇", l: []}, {
            n: "西永镇",
            l: []
        }, {n: "土主镇", l: []}, {n: "井口镇", l: []}, {n: "曾家镇", l: []}, {
            n: "凤凰镇",
            l: []
        }, {n: "中梁镇", l: []}]
    }, {
        n: "大渡口区",
        l: [{n: "内环以内", l: []}, {n: "茄子溪街道", l: []}, {n: "建胜镇", l: []}, {
            n: "跳磴镇",
            l: []
        }]
    }, {
        n: "綦江区",
        l: [{n: "古南街道", l: []}, {n: "文龙街道", l: []}, {n: "万盛街道", l: []}, {
            n: "东林街道",
            l: []
        }, {n: "三江街道", l: []}, {n: "安稳镇", l: []}, {n: "打通镇", l: []}, {
            n: "丁山镇",
            l: []
        }, {n: "东溪镇", l: []}, {n: "扶欢镇", l: []}, {n: "赶水镇", l: []}, {
            n: "郭扶镇",
            l: []
        }, {n: "横山镇", l: []}, {n: "隆盛镇", l: []}, {n: "三角镇", l: []}, {
            n: "石壕镇",
            l: []
        }, {n: "石角镇", l: []}, {n: "新盛镇", l: []}, {n: "永城镇", l: []}, {
            n: "永新镇",
            l: []
        }, {n: "中峰镇", l: []}, {n: "篆塘镇", l: []}, {n: "丛林镇", l: []}, {
            n: "关坝镇",
            l: []
        }, {n: "黑山镇", l: []}, {n: "金桥镇", l: []}, {n: "南桐镇", l: []}, {
            n: "青年镇",
            l: []
        }, {n: "石林镇", l: []}, {n: "万东镇", l: []}]
    }, {n: "渝中区", l: [{n: "全境", l: []}]}, {n: "高新区", l: [{n: "全境", l: []}]}, {
        n: "北部新区",
        l: [{n: "全境", l: []}]
    }]
}, {
    n: "河北",
    l: [{
        n: "石家庄市",
        l: [{n: "辛集市", l: []}, {n: "晋州市", l: []}, {n: "新乐市", l: []}, {
            n: "井陉县",
            l: []
        }, {n: "栾城县", l: []}, {n: "行唐县", l: []}, {n: "灵寿县", l: []}, {
            n: "高邑县",
            l: []
        }, {n: "赵县", l: []}, {n: "赞皇县", l: []}, {n: "深泽县", l: []}, {
            n: "无极县",
            l: []
        }, {n: "元氏县", l: []}, {n: "井陉矿区", l: []}, {n: "平山县", l: []}, {
            n: "藁城市",
            l: []
        }, {n: "鹿泉市", l: []}, {n: "正定县", l: []}, {n: "新华区", l: []}, {
            n: "桥西区",
            l: []
        }, {n: "桥东区", l: []}, {n: "裕华区", l: []}, {n: "长安区", l: []}]
    }, {
        n: "邯郸市",
        l: [{n: "邯郸县", l: []}, {n: "峰峰矿区", l: []}, {n: "曲周县", l: []}, {
            n: "馆陶县",
            l: []
        }, {n: "魏县", l: []}, {n: "成安县", l: []}, {n: "大名县", l: []}, {
            n: "涉县",
            l: []
        }, {n: "鸡泽县", l: []}, {n: "邱县", l: []}, {n: "广平县", l: []}, {
            n: "肥乡县",
            l: []
        }, {n: "磁县", l: []}, {n: "临漳县", l: []}, {n: "永年县", l: []}, {
            n: "丛台区",
            l: []
        }, {n: "邯山区", l: []}, {n: "复兴区", l: []}, {n: "武安市", l: []}]
    }, {
        n: "邢台市",
        l: [{n: "邢台县", l: []}, {n: "南宫市", l: []}, {n: "沙河市", l: []}, {
            n: "柏乡县",
            l: []
        }, {n: "任县", l: []}, {n: "清河县", l: []}, {n: "隆尧县", l: []}, {
            n: "临城县",
            l: []
        }, {n: "广宗县", l: []}, {n: "临西县", l: []}, {n: "内丘县", l: []}, {
            n: "平乡县",
            l: []
        }, {n: "巨鹿县", l: []}, {n: "新河县", l: []}, {n: "南和县", l: []}, {
            n: "宁晋县",
            l: []
        }, {n: "威县", l: []}, {n: "桥西区", l: []}, {n: "桥东区", l: []}]
    }, {
        n: "保定市",
        l: [{n: "安国市", l: []}, {n: "满城县", l: []}, {n: "清苑县", l: []}, {
            n: "涞水县",
            l: []
        }, {n: "阜平县", l: []}, {n: "定兴县", l: []}, {n: "唐县", l: []}, {
            n: "高阳县",
            l: []
        }, {n: "容城县", l: []}, {n: "涞源县", l: []}, {n: "望都县", l: []}, {
            n: "易县",
            l: []
        }, {n: "曲阳县", l: []}, {n: "蠡县", l: []}, {n: "顺平县", l: []}, {
            n: "博野县",
            l: []
        }, {n: "雄县", l: []}, {n: "新市区", l: []}, {n: "北市区", l: []}, {
            n: "南市区",
            l: []
        }, {n: "安新县", l: []}, {n: "涿州市", l: []}, {n: "定州市", l: []}, {
            n: "徐水县",
            l: []
        }, {n: "高碑店市", l: []}]
    }, {
        n: "张家口市",
        l: [{n: "宣化县", l: []}, {n: "康保县", l: []}, {n: "张北县", l: []}, {
            n: "阳原县",
            l: []
        }, {n: "赤城县", l: []}, {n: "怀安县", l: []}, {n: "怀来县", l: []}, {
            n: "崇礼县",
            l: []
        }, {n: "尚义县", l: []}, {n: "蔚县", l: []}, {n: "涿鹿县", l: []}, {
            n: "万全县",
            l: []
        }, {n: "下花园区", l: []}, {n: "沽源县", l: []}, {n: "宣化区", l: []}, {
            n: "桥西区",
            l: []
        }, {n: "桥东区", l: []}]
    }, {
        n: "承德市",
        l: [{n: "兴隆县", l: []}, {n: "平泉县", l: []}, {n: "滦平县", l: []}, {
            n: "丰宁县",
            l: []
        }, {n: "围场县", l: []}, {n: "宽城县", l: []}, {n: "隆化县", l: []}, {
            n: "承德县",
            l: []
        }, {n: "双滦区", l: []}, {n: "鹰手营子矿区", l: []}, {n: "双桥区", l: []}]
    }, {
        n: "秦皇岛市",
        l: [{n: "卢龙县", l: []}, {n: "青龙县", l: []}, {n: "昌黎县", l: []}, {
            n: "北戴河区",
            l: []
        }, {n: "抚宁县", l: []}, {n: "海港区", l: []}, {n: "山海关区", l: []}]
    }, {
        n: "唐山市",
        l: [{n: "遵化市", l: []}, {n: "丰南区", l: []}, {n: "迁西县", l: []}, {
            n: "滦南县",
            l: []
        }, {n: "玉田县", l: []}, {n: "曹妃甸区", l: []}, {n: "乐亭县", l: []}, {
            n: "滦县",
            l: []
        }, {n: "古冶区", l: []}, {n: "开平区", l: []}, {n: "路北区", l: []}, {
            n: "路南区",
            l: []
        }, {n: "迁安市", l: []}, {n: "丰润区", l: []}]
    }, {
        n: "沧州市",
        l: [{n: "沧县", l: []}, {n: "泊头市", l: []}, {n: "河间市", l: []}, {
            n: "献县",
            l: []
        }, {n: "肃宁县", l: []}, {n: "青县", l: []}, {n: "东光县", l: []}, {
            n: "吴桥县",
            l: []
        }, {n: "南皮县", l: []}, {n: "盐山县", l: []}, {n: "海兴县", l: []}, {
            n: "孟村县",
            l: []
        }, {n: "运河区", l: []}, {n: "新华区", l: []}, {n: "任丘市", l: []}, {n: "黄骅市", l: []}]
    }, {
        n: "廊坊市",
        l: [{n: "固安县", l: []}, {n: "永清县", l: []}, {n: "香河县", l: []}, {
            n: "大城县",
            l: []
        }, {n: "文安县", l: []}, {n: "大厂县", l: []}, {n: "安次区", l: []}, {
            n: "广阳区",
            l: []
        }, {n: "开发区", l: []}, {n: "三河市", l: []}, {n: "霸州市", l: []}]
    }, {
        n: "衡水市",
        l: [{n: "冀州市", l: []}, {n: "深州市", l: []}, {n: "饶阳县", l: []}, {
            n: "枣强县",
            l: []
        }, {n: "故城县", l: []}, {n: "阜城县", l: []}, {n: "安平县", l: []}, {
            n: "武邑县",
            l: []
        }, {n: "景县", l: []}, {n: "武强县", l: []}, {n: "桃城区", l: []}]
    }]
}, {
    n: "山西",
    l: [{
        n: "太原市",
        l: [{n: "阳曲县", l: []}, {n: "古交市", l: []}, {n: "娄烦县", l: []}, {
            n: "清徐县",
            l: []
        }, {n: "小店区", l: []}, {n: "迎泽区", l: []}, {n: "晋源区", l: []}, {
            n: "万柏林区",
            l: []
        }, {n: "尖草坪区", l: []}, {n: "杏花岭区", l: []}]
    }, {
        n: "大同市",
        l: [{n: "大同县", l: []}, {n: "天镇县", l: []}, {n: "灵丘县", l: []}, {
            n: "阳高县",
            l: []
        }, {n: "左云县", l: []}, {n: "浑源县", l: []}, {n: "广灵县", l: []}, {
            n: "新荣区",
            l: []
        }, {n: "南郊区", l: []}, {n: "矿区", l: []}, {n: "城区", l: []}]
    }, {
        n: "阳泉市",
        l: [{n: "盂县", l: []}, {n: "平定县", l: []}, {n: "郊区", l: []}, {
            n: "矿区",
            l: []
        }, {n: "城区", l: []}]
    }, {
        n: "晋城市",
        l: [{n: "高平市", l: []}, {n: "阳城县", l: []}, {n: "沁水县", l: []}, {
            n: "陵川县",
            l: []
        }, {n: "泽州县", l: []}, {n: "城区", l: []}]
    }, {
        n: "朔州市",
        l: [{n: "山阴县", l: []}, {n: "右玉县", l: []}, {n: "应县", l: []}, {
            n: "怀仁县",
            l: []
        }, {n: "朔城区", l: []}, {n: "平鲁区", l: []}]
    }, {
        n: "晋中市",
        l: [{n: "介休市", l: []}, {n: "昔阳县", l: []}, {n: "祁县", l: []}, {
            n: "左权县",
            l: []
        }, {n: "寿阳县", l: []}, {n: "太谷县", l: []}, {n: "和顺县", l: []}, {
            n: "灵石县",
            l: []
        }, {n: "平遥县", l: []}, {n: "榆社县", l: []}, {n: "榆次区", l: []}]
    }, {
        n: "忻州市",
        l: [{n: "原平市", l: []}, {n: "代县", l: []}, {n: "神池县", l: []}, {
            n: "五寨县",
            l: []
        }, {n: "五台县", l: []}, {n: "偏关县", l: []}, {n: "宁武县", l: []}, {
            n: "静乐县",
            l: []
        }, {n: "繁峙县", l: []}, {n: "河曲县", l: []}, {n: "保德县", l: []}, {
            n: "定襄县",
            l: []
        }, {n: "忻府区", l: []}, {n: "岢岚县", l: []}]
    }, {
        n: "吕梁市",
        l: [{n: "离石区", l: []}, {n: "孝义市", l: []}, {n: "汾阳市", l: []}, {
            n: "文水县",
            l: []
        }, {n: "中阳县", l: []}, {n: "兴县", l: []}, {n: "临县", l: []}, {
            n: "方山县",
            l: []
        }, {n: "柳林县", l: []}, {n: "岚县", l: []}, {n: "交口县", l: []}, {
            n: "交城县",
            l: []
        }, {n: "石楼县", l: []}]
    }, {
        n: "临汾市",
        l: [{n: "侯马市", l: []}, {n: "霍州市", l: []}, {n: "汾西县", l: []}, {
            n: "吉县",
            l: []
        }, {n: "安泽县", l: []}, {n: "浮山县", l: []}, {n: "大宁县", l: []}, {
            n: "古县",
            l: []
        }, {n: "隰县", l: []}, {n: "襄汾县", l: []}, {n: "翼城县", l: []}, {
            n: "永和县",
            l: []
        }, {n: "乡宁县", l: []}, {n: "洪洞县", l: []}, {n: "蒲县", l: []}, {
            n: "曲沃县",
            l: []
        }, {n: "尧都区", l: []}]
    }, {
        n: "运城市",
        l: [{n: "河津市", l: []}, {n: "永济市", l: []}, {n: "新绛县", l: []}, {
            n: "平陆县",
            l: []
        }, {n: "垣曲县", l: []}, {n: "绛县", l: []}, {n: "稷山县", l: []}, {
            n: "芮城县",
            l: []
        }, {n: "夏县", l: []}, {n: "临猗县", l: []}, {n: "万荣县", l: []}, {
            n: "闻喜县",
            l: []
        }, {n: "盐湖区", l: []}]
    }, {
        n: "长治市",
        l: [{n: "长治县", l: []}, {n: "潞城市", l: []}, {n: "郊区", l: []}, {
            n: "襄垣县",
            l: []
        }, {n: "屯留县", l: []}, {n: "平顺县", l: []}, {n: "黎城县", l: []}, {
            n: "壶关县",
            l: []
        }, {n: "长子县", l: []}, {n: "武乡县", l: []}, {n: "沁县", l: []}, {
            n: "沁源县",
            l: []
        }, {n: "城区", l: []}]
    }]
}, {
    n: "河南",
    l: [{
        n: "郑州市",
        l: [{n: "新密市", l: []}, {n: "登封市", l: []}, {n: "上街区", l: []}, {
            n: "惠济区",
            l: []
        }, {n: "金水区", l: []}, {n: "管城区", l: []}, {n: "二七区", l: []}, {
            n: "中原区",
            l: []
        }, {n: "郑东新区", l: []}, {n: "新郑市", l: []}, {n: "巩义市", l: []}, {
            n: "荥阳市",
            l: []
        }, {n: "中牟县", l: []}, {n: "经济开发区", l: []}, {n: "高新技术开发区", l: []}]
    }, {
        n: "开封市",
        l: [{n: "开封县", l: []}, {n: "杞县", l: []}, {n: "兰考县", l: []}, {
            n: "尉氏县",
            l: []
        }, {n: "通许县", l: []}, {n: "金明区", l: []}, {n: "龙亭区", l: []}, {
            n: "顺河区",
            l: []
        }, {n: "鼓楼区", l: []}, {n: "禹王台区", l: []}]
    }, {
        n: "洛阳市",
        l: [{n: "偃师市", l: []}, {n: "孟津县", l: []}, {n: "汝阳县", l: []}, {
            n: "伊川县",
            l: []
        }, {n: "洛宁县", l: []}, {n: "宜阳县", l: []}, {n: "栾川县", l: []}, {
            n: "新安县",
            l: []
        }, {n: "吉利区", l: []}, {n: "涧西区", l: []}, {n: "瀍河区", l: []}, {
            n: "老城区",
            l: []
        }, {n: "西工区", l: []}, {n: "嵩县", l: []}, {n: "伊滨区", l: []}, {n: "洛龙区", l: []}]
    }, {
        n: "平顶山市",
        l: [{n: "汝州市", l: []}, {n: "舞钢市", l: []}, {n: "郏县", l: []}, {
            n: "叶县",
            l: []
        }, {n: "鲁山县", l: []}, {n: "宝丰县", l: []}, {n: "石龙区", l: []}, {
            n: "湛河区",
            l: []
        }, {n: "卫东区", l: []}, {n: "新华区", l: []}]
    }, {
        n: "焦作市",
        l: [{n: "沁阳市", l: []}, {n: "孟州市", l: []}, {n: "修武县", l: []}, {
            n: "温县",
            l: []
        }, {n: "武陟县", l: []}, {n: "博爱县", l: []}, {n: "山阳区", l: []}, {
            n: "解放区",
            l: []
        }, {n: "马村区", l: []}, {n: "中站区", l: []}]
    }, {
        n: "鹤壁市",
        l: [{n: "浚县", l: []}, {n: "淇县", l: []}, {n: "鹤山区", l: []}, {
            n: "山城区",
            l: []
        }, {n: "淇滨区", l: []}]
    }, {
        n: "新乡市",
        l: [{n: "卫辉市", l: []}, {n: "辉县市", l: []}, {n: "新乡县", l: []}, {
            n: "获嘉县",
            l: []
        }, {n: "原阳县", l: []}, {n: "长垣县", l: []}, {n: "延津县", l: []}, {
            n: "封丘县",
            l: []
        }, {n: "凤泉区", l: []}, {n: "牧野区", l: []}, {n: "红旗区", l: []}, {n: "卫滨区", l: []}]
    }, {
        n: "安阳市",
        l: [{n: "林州市", l: []}, {n: "安阳县", l: []}, {n: "滑县", l: []}, {
            n: "汤阴县",
            l: []
        }, {n: "内黄县", l: []}, {n: "龙安区", l: []}, {n: "殷都区", l: []}, {
            n: "文峰区",
            l: []
        }, {n: "开发区", l: []}, {n: "北关区", l: []}]
    }, {
        n: "濮阳市",
        l: [{n: "濮阳县", l: []}, {n: "南乐县", l: []}, {n: "台前县", l: []}, {
            n: "清丰县",
            l: []
        }, {n: "范县", l: []}, {n: "华龙区", l: []}]
    }, {
        n: "许昌市",
        l: [{n: "禹州市", l: []}, {n: "长葛市", l: []}, {n: "许昌县", l: []}, {
            n: "鄢陵县",
            l: []
        }, {n: "襄城县", l: []}, {n: "魏都区", l: []}]
    }, {
        n: "漯河市",
        l: [{n: "郾城区", l: []}, {n: "临颍县", l: []}, {n: "召陵区", l: []}, {
            n: "舞阳县",
            l: []
        }, {n: "源汇区", l: []}]
    }, {
        n: "三门峡市",
        l: [{n: "义马市", l: []}, {n: "灵宝市", l: []}, {n: "陕县", l: []}, {
            n: "卢氏县",
            l: []
        }, {n: "渑池县", l: []}, {n: "湖滨区", l: []}]
    }, {
        n: "南阳市",
        l: [{n: "邓州市", l: []}, {n: "桐柏县", l: []}, {n: "方城县", l: []}, {
            n: "淅川县",
            l: []
        }, {n: "镇平县", l: []}, {n: "唐河县", l: []}, {n: "南召县", l: []}, {
            n: "内乡县",
            l: []
        }, {n: "新野县", l: []}, {n: "社旗县", l: []}, {n: "西峡县", l: []}, {
            n: "卧龙区",
            l: []
        }, {n: "宛城区", l: []}]
    }, {
        n: "商丘市",
        l: [{n: "永城市", l: []}, {n: "宁陵县", l: []}, {n: "虞城县", l: []}, {
            n: "民权县",
            l: []
        }, {n: "夏邑县", l: []}, {n: "柘城县", l: []}, {n: "睢县", l: []}, {
            n: "睢阳区",
            l: []
        }, {n: "梁园区", l: []}]
    }, {
        n: "周口市",
        l: [{n: "项城市", l: []}, {n: "商水县", l: []}, {n: "淮阳县", l: []}, {
            n: "太康县",
            l: []
        }, {n: "鹿邑县", l: []}, {n: "西华县", l: []}, {n: "扶沟县", l: []}, {
            n: "沈丘县",
            l: []
        }, {n: "郸城县", l: []}, {n: "东新区", l: []}, {n: "经济开发区", l: []}, {n: "川汇区", l: []}]
    }, {
        n: "驻马店市",
        l: [{n: "确山县", l: []}, {n: "新蔡县", l: []}, {n: "上蔡县", l: []}, {
            n: "泌阳县",
            l: []
        }, {n: "西平县", l: []}, {n: "遂平县", l: []}, {n: "汝南县", l: []}, {
            n: "平舆县",
            l: []
        }, {n: "正阳县", l: []}, {n: "驿城区", l: []}]
    }, {
        n: "信阳市",
        l: [{n: "潢川县", l: []}, {n: "淮滨县", l: []}, {n: "息县", l: []}, {
            n: "新县",
            l: []
        }, {n: "固始县", l: []}, {n: "罗山县", l: []}, {n: "光山县", l: []}, {
            n: "商城县",
            l: []
        }, {n: "平桥区", l: []}, {n: "浉河区", l: []}]
    }, {
        n: "济源市",
        l: [{n: "五龙口镇", l: []}, {n: "下冶镇", l: []}, {n: "轵城镇", l: []}, {
            n: "王屋镇",
            l: []
        }, {n: "思礼镇", l: []}, {n: "邵原镇", l: []}, {n: "坡头镇", l: []}, {
            n: "梨林镇",
            l: []
        }, {n: "克井镇", l: []}, {n: "大峪镇", l: []}, {n: "承留镇", l: []}, {n: "城区", l: []}]
    }]
}, {
    n: "辽宁",
    l: [{
        n: "沈阳市",
        l: [{n: "苏家屯区", l: []}, {n: "新民市", l: []}, {n: "法库县", l: []}, {
            n: "辽中县",
            l: []
        }, {n: "康平县", l: []}, {n: "皇姑区", l: []}, {n: "铁西区", l: []}, {
            n: "大东区",
            l: []
        }, {n: "沈河区", l: []}, {n: "东陵区", l: []}, {n: "于洪区", l: []}, {
            n: "和平区",
            l: []
        }, {n: "浑南新区", l: []}, {n: "沈北新区", l: []}]
    }, {
        n: "大连市",
        l: [{n: "普兰店市", l: []}, {n: "瓦房店市", l: []}, {n: "庄河市", l: []}, {
            n: "长海县",
            l: []
        }, {n: "沙河口区", l: []}, {n: "西岗区", l: []}, {n: "中山区", l: []}, {
            n: "甘井子区",
            l: []
        }, {n: "高新园区", l: []}, {n: "大连开发区", l: []}, {n: "金州区", l: []}, {n: "旅顺口区", l: []}]
    }, {
        n: "鞍山市",
        l: [{n: "台安县", l: []}, {n: "海城市", l: []}, {n: "岫岩县", l: []}, {
            n: "铁东区",
            l: []
        }, {n: "立山区", l: []}, {n: "铁西区", l: []}, {n: "千山区", l: []}]
    }, {
        n: "抚顺市",
        l: [{n: "抚顺县", l: []}, {n: "新宾县", l: []}, {n: "清原县", l: []}, {
            n: "望花区",
            l: []
        }, {n: "东洲区", l: []}, {n: "新抚区", l: []}, {n: "顺城区", l: []}]
    }, {
        n: "本溪市",
        l: [{n: "桓仁县", l: []}, {n: "南芬区", l: []}, {n: "本溪县", l: []}, {
            n: "平山区",
            l: []
        }, {n: "溪湖区", l: []}, {n: "明山区", l: []}]
    }, {
        n: "丹东市",
        l: [{n: "宽甸县", l: []}, {n: "元宝区", l: []}, {n: "振兴区", l: []}, {
            n: "振安区",
            l: []
        }, {n: "东港市", l: []}, {n: "凤城市", l: []}]
    }, {
        n: "锦州市",
        l: [{n: "义县", l: []}, {n: "凌海市", l: []}, {n: "北镇市", l: []}, {
            n: "黑山县",
            l: []
        }, {n: "古塔区", l: []}, {n: "凌河区", l: []}, {n: "太和区", l: []}, {n: "经济技术开发区", l: []}]
    }, {
        n: "葫芦岛市",
        l: [{n: "绥中县", l: []}, {n: "建昌县", l: []}, {n: "南票区", l: []}, {
            n: "龙港区",
            l: []
        }, {n: "连山区", l: []}, {n: "兴城市", l: []}]
    }, {
        n: "营口市",
        l: [{n: "大石桥市", l: []}, {n: "盖州市", l: []}, {n: "老边区", l: []}, {
            n: "西市区",
            l: []
        }, {n: "站前区", l: []}, {n: "鲅鱼圈区", l: []}]
    }, {
        n: "盘锦市",
        l: [{n: "盘山县", l: []}, {n: "大洼县", l: []}, {n: "兴隆台区", l: []}, {
            n: "双台子区",
            l: []
        }]
    }, {
        n: "阜新市",
        l: [{n: "阜新县", l: []}, {n: "彰武县", l: []}, {n: "清河门区", l: []}, {
            n: "新邱区",
            l: []
        }, {n: "海州区", l: []}, {n: "太平区", l: []}, {n: "细河区", l: []}]
    }, {
        n: "辽阳市",
        l: [{n: "辽阳县", l: []}, {n: "太子河区", l: []}, {n: "弓长岭区", l: []}, {
            n: "宏伟区",
            l: []
        }, {n: "白塔区", l: []}, {n: "文圣区", l: []}, {n: "灯塔市", l: []}]
    }, {
        n: "朝阳市",
        l: [{n: "凌源市", l: []}, {n: "北票市", l: []}, {n: "喀喇沁左翼县", l: []}, {
            n: "朝阳县",
            l: []
        }, {n: "建平县", l: []}, {n: "龙城区", l: []}, {n: "双塔区", l: []}]
    }, {
        n: "铁岭市",
        l: [{n: "银州区", l: []}, {n: "清河区", l: []}, {n: "开原市", l: []}, {
            n: "铁岭县",
            l: []
        }, {n: "西丰县", l: []}, {n: "昌图县", l: []}, {n: "调兵山市", l: []}]
    }]
}, {
    n: "吉林",
    l: [{
        n: "长春市",
        l: [{n: "榆树市", l: []}, {n: "九台市", l: []}, {n: "农安县", l: []}, {
            n: "德惠市",
            l: []
        }, {n: "双阳区", l: []}, {n: "朝阳区", l: []}, {n: "南关区", l: []}, {
            n: "宽城区",
            l: []
        }, {n: "二道区", l: []}, {n: "绿园区", l: []}, {n: "净月区", l: []}, {
            n: "汽车产业开发区",
            l: []
        }, {n: "高新技术开发区", l: []}, {n: "经济技术开发区", l: []}]
    }, {
        n: "吉林市",
        l: [{n: "舒兰市", l: []}, {n: "桦甸市", l: []}, {n: "蛟河市", l: []}, {
            n: "磐石市",
            l: []
        }, {n: "永吉县", l: []}, {n: "昌邑区", l: []}, {n: "龙潭区", l: []}, {
            n: "船营区",
            l: []
        }, {n: "丰满区", l: []}]
    }, {
        n: "四平市",
        l: [{n: "公主岭市", l: []}, {n: "双辽市", l: []}, {n: "梨树县", l: []}, {
            n: "伊通县",
            l: []
        }, {n: "铁东区", l: []}, {n: "铁西区", l: []}]
    }, {
        n: "通化市",
        l: [{n: "梅河口市", l: []}, {n: "集安市", l: []}, {n: "通化县", l: []}, {
            n: "辉南县",
            l: []
        }, {n: "柳河县", l: []}, {n: "二道江区", l: []}, {n: "东昌区", l: []}]
    }, {
        n: "白山市",
        l: [{n: "临江市", l: []}, {n: "江源区", l: []}, {n: "靖宇县", l: []}, {
            n: "抚松县",
            l: []
        }, {n: "长白县", l: []}, {n: "浑江区", l: []}]
    }, {
        n: "松原市",
        l: [{n: "乾安县", l: []}, {n: "长岭县", l: []}, {n: "扶余县", l: []}, {
            n: "宁江区",
            l: []
        }, {n: "前郭县", l: []}]
    }, {
        n: "白城市",
        l: [{n: "大安市", l: []}, {n: "洮南市", l: []}, {n: "通榆县", l: []}, {
            n: "镇赉县",
            l: []
        }, {n: "洮北区", l: []}]
    }, {
        n: "延边州",
        l: [{n: "图们市", l: []}, {n: "敦化市", l: []}, {n: "珲春市", l: []}, {
            n: "龙井市",
            l: []
        }, {n: "和龙市", l: []}, {n: "汪清县", l: []}, {n: "安图县", l: []}, {n: "延吉市", l: []}]
    }, {
        n: "辽源市",
        l: [{n: "龙山区", l: []}, {n: "西安区", l: []}, {n: "东丰县", l: []}, {n: "东辽县", l: []}]
    }]
}, {
    n: "黑龙江",
    l: [{
        n: "哈尔滨市",
        l: [{n: "阿城区", l: []}, {n: "尚志市", l: []}, {n: "双城市", l: []}, {
            n: "五常市",
            l: []
        }, {n: "方正县", l: []}, {n: "宾县", l: []}, {n: "依兰县", l: []}, {
            n: "巴彦县",
            l: []
        }, {n: "通河县", l: []}, {n: "木兰县", l: []}, {n: "延寿县", l: []}, {
            n: "呼兰区",
            l: []
        }, {n: "松北区", l: []}, {n: "道里区", l: []}, {n: "南岗区", l: []}, {
            n: "道外区",
            l: []
        }, {n: "香坊区", l: []}, {n: "平房区", l: []}]
    }, {
        n: "齐齐哈尔市",
        l: [{n: "梅里斯区", l: []}, {n: "昂昂溪区", l: []}, {n: "富拉尔基区", l: []}, {
            n: "碾子山区",
            l: []
        }, {n: "讷河市", l: []}, {n: "富裕县", l: []}, {n: "拜泉县", l: []}, {
            n: "甘南县",
            l: []
        }, {n: "依安县", l: []}, {n: "克山县", l: []}, {n: "龙江县", l: []}, {
            n: "克东县",
            l: []
        }, {n: "泰来县", l: []}, {n: "建华区", l: []}, {n: "龙沙区", l: []}, {n: "铁锋区", l: []}]
    }, {
        n: "鹤岗市",
        l: [{n: "萝北县", l: []}, {n: "绥滨县", l: []}, {n: "兴山区", l: []}, {
            n: "向阳区",
            l: []
        }, {n: "工农区", l: []}, {n: "南山区", l: []}, {n: "兴安区", l: []}, {n: "东山区", l: []}]
    }, {
        n: "双鸭山市",
        l: [{n: "集贤县", l: []}, {n: "宝清县", l: []}, {n: "友谊县", l: []}, {
            n: "饶河县",
            l: []
        }, {n: "尖山区", l: []}, {n: "岭东区", l: []}, {n: "四方台区", l: []}, {n: "宝山区", l: []}]
    }, {
        n: "鸡西市",
        l: [{n: "密山市", l: []}, {n: "虎林市", l: []}, {n: "鸡东县", l: []}, {
            n: "恒山区",
            l: []
        }, {n: "滴道区", l: []}, {n: "梨树区", l: []}, {n: "城子河区", l: []}, {
            n: "麻山区",
            l: []
        }, {n: "鸡冠区", l: []}]
    }, {
        n: "大庆市",
        l: [{n: "萨尔图区", l: []}, {n: "龙凤区", l: []}, {n: "让胡路区", l: []}, {
            n: "红岗区",
            l: []
        }, {n: "大同区", l: []}, {n: "林甸县", l: []}, {n: "肇州县", l: []}, {
            n: "肇源县",
            l: []
        }, {n: "杜尔伯特县", l: []}]
    }, {
        n: "伊春市",
        l: [{n: "铁力市", l: []}, {n: "嘉荫县", l: []}, {n: "伊春区", l: []}, {
            n: "南岔区",
            l: []
        }, {n: "友好区", l: []}, {n: "西林区", l: []}, {n: "翠峦区", l: []}, {
            n: "新青区",
            l: []
        }, {n: "美溪区", l: []}, {n: "金山屯区", l: []}, {n: "五营区", l: []}, {
            n: "乌马河区",
            l: []
        }, {n: "汤旺河区", l: []}, {n: "带岭区", l: []}, {n: "乌伊岭区", l: []}, {
            n: "红星区",
            l: []
        }, {n: "上甘岭区", l: []}]
    }, {
        n: "牡丹江市",
        l: [{n: "海林市", l: []}, {n: "宁安市", l: []}, {n: "穆棱市", l: []}, {
            n: "林口县",
            l: []
        }, {n: "东宁县", l: []}, {n: "爱民区", l: []}, {n: "东安区", l: []}, {
            n: "阳明区",
            l: []
        }, {n: "西安区", l: []}, {n: "绥芬河市", l: []}]
    }, {
        n: "佳木斯市",
        l: [{n: "同江市", l: []}, {n: "富锦市", l: []}, {n: "桦川县", l: []}, {
            n: "抚远县",
            l: []
        }, {n: "桦南县", l: []}, {n: "汤原县", l: []}, {n: "前进区", l: []}, {
            n: "向阳区",
            l: []
        }, {n: "东风区", l: []}, {n: "郊区", l: []}]
    }, {
        n: "七台河市",
        l: [{n: "勃利县", l: []}, {n: "桃山区", l: []}, {n: "新兴区", l: []}, {
            n: "茄子河区",
            l: []
        }]
    }, {
        n: "黑河市",
        l: [{n: "北安市", l: []}, {n: "五大连池市", l: []}, {n: "逊克县", l: []}, {
            n: "孙吴县",
            l: []
        }, {n: "嫩江县", l: []}, {n: "爱辉区", l: []}]
    }, {
        n: "绥化市",
        l: [{n: "安达市", l: []}, {n: "肇东市", l: []}, {n: "海伦市", l: []}, {
            n: "绥棱县",
            l: []
        }, {n: "兰西县", l: []}, {n: "明水县", l: []}, {n: "青冈县", l: []}, {
            n: "庆安县",
            l: []
        }, {n: "望奎县", l: []}, {n: "北林区", l: []}]
    }, {
        n: "大兴安岭地区",
        l: [{n: "呼玛县", l: []}, {n: "塔河县", l: []}, {n: "漠河县", l: []}, {
            n: "加格达奇区",
            l: []
        }, {n: "松岭区", l: []}, {n: "呼中区", l: []}, {n: "新林区", l: []}]
    }]
}, {
    n: "内蒙古",
    l: [{
        n: "呼和浩特市",
        l: [{n: "土默特左旗", l: []}, {n: "和林格尔县", l: []}, {n: "武川县", l: []}, {
            n: "托克托县",
            l: []
        }, {n: "清水河县", l: []}, {n: "玉泉区", l: []}, {n: "赛罕区", l: []}, {
            n: "回民区",
            l: []
        }, {n: "新城区", l: []}]
    }, {
        n: "包头市",
        l: [{n: "固阳县", l: []}, {n: "土默特右旗", l: []}, {n: "达茂联合旗", l: []}, {
            n: "石拐区",
            l: []
        }, {n: "白云矿区", l: []}, {n: "东河区", l: []}, {n: "九原区", l: []}, {
            n: "青山区",
            l: []
        }, {n: "昆都仑区", l: []}]
    }, {
        n: "乌海市",
        l: [{n: "海勃湾区", l: []}, {n: "海南区", l: []}, {n: "乌达区", l: []}]
    }, {
        n: "赤峰市",
        l: [{n: "宁城县", l: []}, {n: "敖汉旗", l: []}, {n: "喀喇沁旗", l: []}, {
            n: "翁牛特旗",
            l: []
        }, {n: "巴林右旗", l: []}, {n: "林西县", l: []}, {n: "克什克腾旗", l: []}, {
            n: "巴林左旗",
            l: []
        }, {n: "阿鲁科尔沁旗", l: []}, {n: "元宝山区", l: []}, {n: "松山区", l: []}, {n: "红山区", l: []}]
    }, {
        n: "乌兰察布市",
        l: [{n: "集宁区", l: []}, {n: "丰镇市", l: []}, {n: "兴和县", l: []}, {
            n: "卓资县",
            l: []
        }, {n: "商都县", l: []}, {n: "凉城县", l: []}, {n: "化德县", l: []}, {
            n: "察哈尔右翼前旗",
            l: []
        }, {n: "察哈尔右翼中旗", l: []}, {n: "察哈尔右翼后旗", l: []}, {n: "四子王旗", l: []}]
    }, {
        n: "锡林郭勒盟",
        l: [{n: "锡林浩特市", l: []}, {n: "二连浩特市", l: []}, {n: "多伦县", l: []}, {
            n: "阿巴嘎旗",
            l: []
        }, {n: "西乌珠穆沁旗", l: []}, {n: "东乌珠穆沁旗", l: []}, {n: "苏尼特右旗", l: []}, {
            n: "苏尼特左旗",
            l: []
        }, {n: "太仆寺旗", l: []}, {n: "正镶白旗", l: []}, {n: "正蓝旗", l: []}, {n: "镶黄旗", l: []}]
    }, {
        n: "呼伦贝尔市",
        l: [{n: "海拉尔区", l: []}, {n: "满洲里市", l: []}, {n: "牙克石市", l: []}, {
            n: "扎兰屯市",
            l: []
        }, {n: "根河市", l: []}, {n: "额尔古纳市", l: []}, {n: "陈巴尔虎旗", l: []}, {
            n: "阿荣旗",
            l: []
        }, {n: "新巴尔虎左旗", l: []}, {n: "新巴尔虎右旗", l: []}, {n: "鄂伦春旗", l: []}, {
            n: "莫力达瓦旗",
            l: []
        }, {n: "鄂温克族旗", l: []}]
    }, {
        n: "鄂尔多斯市",
        l: [{n: "东胜区", l: []}, {n: "准格尔旗", l: []}, {n: "伊金霍洛旗", l: []}, {
            n: "乌审旗",
            l: []
        }, {n: "杭锦旗", l: []}, {n: "鄂托克旗", l: []}, {n: "鄂托克前旗", l: []}, {
            n: "达拉特旗",
            l: []
        }, {n: "康巴什新区", l: []}]
    }, {
        n: "巴彦淖尔市",
        l: [{n: "临河区", l: []}, {n: "五原县", l: []}, {n: "磴口县", l: []}, {
            n: "杭锦后旗",
            l: []
        }, {n: "乌拉特中旗", l: []}, {n: "乌拉特后旗 ", l: []}, {n: "乌拉特前旗", l: []}]
    }, {
        n: "阿拉善盟",
        l: [{n: "阿拉善右旗", l: []}, {n: "阿拉善左旗", l: []}, {n: "额济纳旗", l: []}]
    }, {
        n: "兴安盟",
        l: [{n: "乌兰浩特市", l: []}, {n: "阿尔山市", l: []}, {n: "突泉县", l: []}, {
            n: "扎赉特旗",
            l: []
        }, {n: "科尔沁右翼前旗", l: []}, {n: "科尔沁右翼中旗", l: []}]
    }, {
        n: "通辽市",
        l: [{n: "霍林郭勒市", l: []}, {n: "开鲁县", l: []}, {n: "库伦旗", l: []}, {
            n: "奈曼旗",
            l: []
        }, {n: "扎鲁特旗", l: []}, {n: "科尔沁左翼中旗", l: []}, {n: "科尔沁左翼后旗", l: []}, {
            n: "科尔沁区",
            l: []
        }]
    }]
}, {
    n: "江苏",
    l: [{
        n: "南京市",
        l: [{n: "江宁区", l: []}, {n: "高淳区", l: []}, {n: "六合区", l: []}, {
            n: "溧水区",
            l: []
        }, {n: "玄武区", l: []}, {n: "秦淮区", l: []}, {n: "建邺区", l: []}, {
            n: "鼓楼区",
            l: []
        }, {n: "栖霞区", l: []}, {n: "雨花台区", l: []}, {n: "浦口区", l: []}]
    }, {
        n: "徐州市",
        l: [{n: "铜山区", l: []}, {n: "睢宁县", l: []}, {n: "沛县", l: []}, {
            n: "丰县",
            l: []
        }, {n: "贾汪区", l: []}, {n: "金山桥开发区", l: []}, {n: "铜山经济技术开发区", l: []}, {
            n: "八段工业园区",
            l: []
        }, {n: "鼓楼区", l: []}, {n: "邳州市", l: []}, {n: "泉山区", l: []}, {
            n: "新沂市",
            l: []
        }, {n: "云龙区", l: []}]
    }, {
        n: "连云港市",
        l: [{n: "赣榆县", l: []}, {n: "灌云县", l: []}, {n: "东海县", l: []}, {
            n: "灌南县",
            l: []
        }, {n: "连云区", l: []}, {n: "海州区", l: []}, {n: "新浦区", l: []}]
    }, {
        n: "淮安市",
        l: [{n: "楚州区", l: []}, {n: "洪泽县", l: []}, {n: "金湖县", l: []}, {
            n: "盱眙县",
            l: []
        }, {n: "经济开发区", l: []}, {n: "清河区", l: []}, {n: "淮阴区", l: []}, {
            n: "清浦区",
            l: []
        }, {n: "涟水县", l: []}]
    }, {
        n: "宿迁市",
        l: [{n: "宿豫区", l: []}, {n: "泗洪县", l: []}, {n: "宿城区", l: []}, {
            n: "沭阳县",
            l: []
        }, {n: "泗阳县", l: []}, {n: "宿迁经济开发区", l: []}]
    }, {
        n: "盐城市",
        l: [{n: "东台市", l: []}, {n: "大丰市", l: []}, {n: "建湖县", l: []}, {
            n: "响水县",
            l: []
        }, {n: "阜宁县", l: []}, {n: "滨海县", l: []}, {n: "射阳县", l: []}, {
            n: "亭湖区",
            l: []
        }, {n: "盐都区", l: []}]
    }, {
        n: "扬州市",
        l: [{n: "广陵区", l: []}, {n: "邗江区", l: []}, {n: "宝应县", l: []}, {
            n: "仪征市",
            l: []
        }, {n: "高邮市", l: []}, {n: "江都区", l: []}]
    }, {
        n: "泰州市",
        l: [{n: "泰兴市", l: []}, {n: "靖江市", l: []}, {n: "兴化市", l: []}, {
            n: "高港区",
            l: []
        }, {n: "海陵区", l: []}, {n: "姜堰市", l: []}]
    }, {
        n: "南通市",
        l: [{n: "通州区", l: []}, {n: "如东县", l: []}, {n: "海安县", l: []}, {
            n: "港闸区",
            l: []
        }, {n: "崇川区", l: []}, {n: "南通经济技术开发区", l: []}, {n: "如皋市", l: []}, {
            n: "海门市",
            l: []
        }, {n: "启东市", l: []}]
    }, {
        n: "镇江市",
        l: [{n: "扬中市", l: []}, {n: "丹徒区", l: []}, {n: "润州区", l: []}, {
            n: "京口区",
            l: []
        }, {n: "镇江新区", l: []}, {n: "丹阳市", l: []}, {n: "句容市", l: []}, {n: "丹徒新区", l: []}]
    }, {
        n: "常州市",
        l: [{n: "金坛市", l: []}, {n: "溧阳市", l: []}, {n: "新北区", l: []}, {
            n: "戚墅堰区",
            l: []
        }, {n: "钟楼区", l: []}, {n: "天宁区", l: []}, {n: "武进区", l: []}]
    }, {
        n: "无锡市",
        l: [{n: "崇安区", l: []}, {n: "南长区", l: []}, {n: "北塘区", l: []}, {
            n: "锡山区",
            l: []
        }, {n: "惠山区", l: []}, {n: "新区", l: []}, {n: "江阴市", l: []}, {
            n: "宜兴市",
            l: []
        }, {n: "滨湖区", l: []}]
    }, {
        n: "苏州市",
        l: [{n: "常熟市", l: []}, {n: "张家港市", l: []}, {n: "相城区", l: []}, {
            n: "金阊区",
            l: []
        }, {n: "虎丘区", l: []}, {n: "平江区", l: []}, {n: "沧浪区", l: []}, {
            n: "工业园区",
            l: []
        }, {n: "高新区", l: []}, {n: "太仓市", l: []}, {n: "吴江区", l: []}, {
            n: "吴中区",
            l: []
        }, {n: "昆山市", l: []}]
    }]
}, {
    n: "山东",
    l: [{
        n: "济南市",
        l: [{n: "长清区", l: []}, {n: "平阴县", l: []}, {n: "济阳县", l: []}, {
            n: "商河县",
            l: []
        }, {n: "高新区", l: []}, {n: "历城区", l: []}, {n: "天桥区", l: []}, {
            n: "槐荫区",
            l: []
        }, {n: "历下区", l: []}, {n: "市中区", l: []}, {n: "章丘市", l: []}]
    }, {
        n: "青岛市",
        l: [{n: "莱西市", l: []}, {n: "四方区", l: []}, {n: "市北区", l: []}, {
            n: "市南区",
            l: []
        }, {n: "李沧区", l: []}, {n: "黄岛区", l: []}, {n: "即墨市", l: []}, {
            n: "城阳区",
            l: []
        }, {n: "崂山区", l: []}, {n: "胶州市", l: []}, {n: "平度市", l: []}]
    }, {
        n: "淄博市",
        l: [{n: "高青县", l: []}, {n: "沂源县", l: []}, {n: "桓台县", l: []}, {
            n: "周村区",
            l: []
        }, {n: "淄川区", l: []}, {n: "博山区", l: []}, {n: "临淄区", l: []}, {n: "张店区", l: []}]
    }, {
        n: "枣庄市",
        l: [{n: "山亭区", l: []}, {n: "台儿庄区", l: []}, {n: "峄城区", l: []}, {
            n: "薛城区",
            l: []
        }, {n: "市中区", l: []}, {n: "滕州市", l: []}]
    }, {
        n: "东营市",
        l: [{n: "河口区", l: []}, {n: "广饶县", l: []}, {n: "利津县", l: []}, {
            n: "垦利县",
            l: []
        }, {n: "东营区", l: []}]
    }, {
        n: "潍坊市",
        l: [{n: "青州市", l: []}, {n: "诸城市", l: []}, {n: "安丘市", l: []}, {
            n: "高密市",
            l: []
        }, {n: "昌邑市", l: []}, {n: "昌乐县", l: []}, {n: "临朐县", l: []}, {
            n: "坊子区",
            l: []
        }, {n: "潍城区", l: []}, {n: "奎文区", l: []}, {n: "高新区", l: []}, {
            n: "寒亭区",
            l: []
        }, {n: "寿光市", l: []}]
    }, {
        n: "烟台市",
        l: [{n: "莱阳市", l: []}, {n: "招远市", l: []}, {n: "蓬莱市", l: []}, {
            n: "栖霞市",
            l: []
        }, {n: "海阳市", l: []}, {n: "长岛县", l: []}, {n: "芝罘区", l: []}, {
            n: "莱山区",
            l: []
        }, {n: "福山区", l: []}, {n: "牟平区", l: []}, {n: "龙口市", l: []}, {
            n: "莱州市",
            l: []
        }, {n: "开发区", l: []}]
    }, {
        n: "威海市",
        l: [{n: "乳山市", l: []}, {n: "环翠区", l: []}, {n: "荣成市", l: []}, {n: "文登市", l: []}]
    }, {n: "莱芜市", l: [{n: "莱城区", l: []}, {n: "钢城区", l: []}]}, {
        n: "德州市",
        l: [{n: "乐陵市", l: []}, {n: "禹城市", l: []}, {n: "陵县", l: []}, {
            n: "宁津县",
            l: []
        }, {n: "武城县", l: []}, {n: "庆云县", l: []}, {n: "平原县", l: []}, {
            n: "临邑县",
            l: []
        }, {n: "夏津县", l: []}, {n: "德城区", l: []}, {n: "齐河县", l: []}]
    }, {
        n: "临沂市",
        l: [{n: "沂南县", l: []}, {n: "沂水县", l: []}, {n: "费县", l: []}, {
            n: "平邑县",
            l: []
        }, {n: "蒙阴县", l: []}, {n: "临沭县", l: []}, {n: "莒南县", l: []}, {
            n: "郯城县",
            l: []
        }, {n: "罗庄区", l: []}, {n: "兰山区", l: []}, {n: "河东区", l: []}, {n: "兰陵县", l: []}]
    }, {
        n: "聊城市",
        l: [{n: "临清市", l: []}, {n: "阳谷县", l: []}, {n: "茌平县", l: []}, {
            n: "莘县",
            l: []
        }, {n: "东阿县", l: []}, {n: "冠县", l: []}, {n: "高唐县", l: []}, {n: "东昌府区", l: []}]
    }, {
        n: "滨州市",
        l: [{n: "邹平县", l: []}, {n: "沾化县", l: []}, {n: "惠民县", l: []}, {
            n: "博兴县",
            l: []
        }, {n: "阳信县", l: []}, {n: "无棣县", l: []}, {n: "北海新区", l: []}, {n: "滨城区", l: []}]
    }, {
        n: "菏泽市",
        l: [{n: "单县", l: []}, {n: "曹县", l: []}, {n: "定陶县", l: []}, {
            n: "巨野县",
            l: []
        }, {n: "成武县", l: []}, {n: "东明县", l: []}, {n: "郓城县", l: []}, {
            n: "鄄城县",
            l: []
        }, {n: "牡丹区", l: []}]
    }, {
        n: "日照市",
        l: [{n: "五莲县", l: []}, {n: "莒县", l: []}, {n: "岚山区", l: []}, {
            n: "新市区",
            l: []
        }, {n: "东港区", l: []}]
    }, {
        n: "泰安市",
        l: [{n: "东平县", l: []}, {n: "宁阳县", l: []}, {n: "岱岳区", l: []}, {
            n: "泰山区",
            l: []
        }, {n: "肥城市", l: []}, {n: "新泰市", l: []}]
    }, {
        n: "济宁市",
        l: [{n: "梁山县", l: []}, {n: "兖州市", l: []}, {n: "微山县", l: []}, {
            n: "汶上县",
            l: []
        }, {n: "泗水县", l: []}, {n: "嘉祥县", l: []}, {n: "鱼台县", l: []}, {
            n: "金乡县",
            l: []
        }, {n: "任城区", l: []}, {n: "邹城市", l: []}, {n: "市中区", l: []}, {
            n: "曲阜市",
            l: []
        }, {n: "高新区", l: []}]
    }]
}, {
    n: "安徽",
    l: [{
        n: "铜陵市",
        l: [{n: "铜官山区", l: []}, {n: "郊区", l: []}, {n: "狮子山区", l: []}, {
            n: "铜陵县",
            l: []
        }]
    }, {
        n: "合肥市",
        l: [{n: "肥东县", l: []}, {n: "庐江县", l: []}, {n: "包河区", l: []}, {
            n: "蜀山区",
            l: []
        }, {n: "瑶海区", l: []}, {n: "庐阳区", l: []}, {n: "经济技术开发区", l: []}, {
            n: "高新技术开发区",
            l: []
        }, {n: "北城新区", l: []}, {n: "滨湖新区", l: []}, {n: "政务文化新区", l: []}, {
            n: "新站综合开发试验区",
            l: []
        }, {n: "肥西县", l: []}, {n: "巢湖市", l: []}, {n: "长丰县", l: []}]
    }, {
        n: "淮南市",
        l: [{n: "凤台县", l: []}, {n: "田家庵区", l: []}, {n: "大通区", l: []}, {
            n: "谢家集区",
            l: []
        }, {n: "八公山区", l: []}, {n: "潘集区", l: []}, {n: "淮南高新技术开发区", l: []}]
    }, {
        n: "淮北市",
        l: [{n: "杜集区", l: []}, {n: "烈山区", l: []}, {n: "濉溪县", l: []}, {n: "相山区", l: []}]
    }, {
        n: "芜湖市",
        l: [{n: "芜湖县", l: []}, {n: "繁昌县", l: []}, {n: "南陵县", l: []}, {
            n: "无为县",
            l: []
        }, {n: "镜湖区", l: []}, {n: "弋江区", l: []}, {n: "鸠江区", l: []}, {n: "三山区", l: []}]
    }, {
        n: "蚌埠市",
        l: [{n: "怀远县", l: []}, {n: "固镇县", l: []}, {n: "五河县", l: []}, {
            n: "蚌山区",
            l: []
        }, {n: "淮上区", l: []}, {n: "龙子湖区", l: []}, {n: "禹会区", l: []}]
    }, {
        n: "马鞍山市",
        l: [{n: "当涂县", l: []}, {n: "含山县", l: []}, {n: "和县", l: []}, {
            n: "博望区",
            l: []
        }, {n: "花山区", l: []}, {n: "雨山区", l: []}]
    }, {
        n: "安庆市",
        l: [{n: "桐城市", l: []}, {n: "宿松县", l: []}, {n: "枞阳县", l: []}, {
            n: "太湖县",
            l: []
        }, {n: "怀宁县", l: []}, {n: "岳西县", l: []}, {n: "望江县", l: []}, {
            n: "潜山县",
            l: []
        }, {n: "开发区", l: []}, {n: "大观区", l: []}, {n: "宜秀区", l: []}, {n: "迎江区", l: []}]
    }, {
        n: "黄山市",
        l: [{n: "休宁县", l: []}, {n: "歙县", l: []}, {n: "黟县", l: []}, {
            n: "祁门县",
            l: []
        }, {n: "黄山区", l: []}, {n: "徽州区", l: []}, {n: "屯溪区", l: []}]
    }, {
        n: "滁州市",
        l: [{n: "明光市", l: []}, {n: "全椒县", l: []}, {n: "来安县", l: []}, {
            n: "定远县",
            l: []
        }, {n: "凤阳县", l: []}, {n: "南谯区", l: []}, {n: "琅琊区", l: []}, {n: "天长市", l: []}]
    }, {
        n: "阜阳市",
        l: [{n: "界首市", l: []}, {n: "太和县", l: []}, {n: "阜南县", l: []}, {
            n: "颍上县",
            l: []
        }, {n: "临泉县", l: []}, {n: "经济开发区", l: []}, {n: "颍泉区", l: []}, {
            n: "颍州区",
            l: []
        }, {n: "颍东区", l: []}]
    }, {
        n: "亳州市",
        l: [{n: "利辛县", l: []}, {n: "蒙城县", l: []}, {n: "涡阳县", l: []}, {n: "谯城区", l: []}]
    }, {
        n: "宿州市",
        l: [{n: "灵璧县", l: []}, {n: "泗县", l: []}, {n: "萧县", l: []}, {
            n: "砀山县",
            l: []
        }, {n: "经济开发区", l: []}, {n: "埇桥区", l: []}]
    }, {
        n: "池州市",
        l: [{n: "东至县", l: []}, {n: "石台县", l: []}, {n: "青阳县", l: []}, {n: "贵池区", l: []}]
    }, {
        n: "六安市",
        l: [{n: "寿县", l: []}, {n: "霍山县", l: []}, {n: "金寨县", l: []}, {
            n: "霍邱县",
            l: []
        }, {n: "舒城县", l: []}, {n: "金安区", l: []}, {n: "裕安区", l: []}]
    }, {
        n: "宣城市",
        l: [{n: "泾县", l: []}, {n: "旌德县", l: []}, {n: "宁国市", l: []}, {
            n: "郎溪县",
            l: []
        }, {n: "广德县", l: []}, {n: "绩溪县", l: []}, {n: "宣州区", l: []}]
    }]
}, {
    n: "浙江",
    l: [{
        n: "宁波市",
        l: [{n: "慈溪市", l: []}, {n: "奉化市", l: []}, {n: "宁海县", l: []}, {
            n: "象山县",
            l: []
        }, {n: "海曙区", l: []}, {n: "江东区", l: []}, {n: "高新科技开发区", l: []}, {
            n: "北仑区",
            l: []
        }, {n: "镇海区", l: []}, {n: "鄞州区", l: []}, {n: "江北区", l: []}, {n: "余姚市", l: []}]
    }, {
        n: "杭州市",
        l: [{n: "余杭区", l: []}, {n: "萧山区", l: []}, {n: "富阳市", l: []}, {
            n: "桐庐县",
            l: []
        }, {n: "建德市", l: []}, {n: "淳安县", l: []}, {n: "江干区", l: []}, {
            n: "滨江区",
            l: []
        }, {n: "上城区", l: []}, {n: "下城区", l: []}, {n: "拱墅区", l: []}, {
            n: "西湖区",
            l: []
        }, {n: "下沙区", l: []}, {n: "临安市", l: []}]
    }, {
        n: "温州市",
        l: [{n: "文成县", l: []}, {n: "平阳县", l: []}, {n: "泰顺县", l: []}, {
            n: "洞头县",
            l: []
        }, {n: "苍南县", l: []}, {n: "龙湾区", l: []}, {n: "茶山高教园区", l: []}, {
            n: "瑞安市",
            l: []
        }, {n: "乐清市", l: []}, {n: "鹿城区", l: []}, {n: "瓯海区", l: []}, {n: "永嘉县", l: []}]
    }, {
        n: "嘉兴市",
        l: [{n: "海宁市", l: []}, {n: "海盐县", l: []}, {n: "南湖区", l: []}, {
            n: "秀洲区",
            l: []
        }, {n: "桐乡市", l: []}, {n: "平湖市", l: []}, {n: "嘉善县", l: []}]
    }, {
        n: "湖州市",
        l: [{n: "长兴县", l: []}, {n: "德清县", l: []}, {n: "安吉县", l: []}, {
            n: "南浔区",
            l: []
        }, {n: "吴兴区", l: []}]
    }, {
        n: "绍兴市",
        l: [{n: "诸暨市", l: []}, {n: "上虞区", l: []}, {n: "嵊州市", l: []}, {
            n: "新昌县",
            l: []
        }, {n: "柯桥区", l: []}, {n: "越城区", l: []}]
    }, {
        n: "金华市",
        l: [{n: "金东区", l: []}, {n: "兰溪市", l: []}, {n: "婺城区", l: []}, {
            n: "义乌市",
            l: []
        }, {n: "东阳市", l: []}, {n: "永康市", l: []}, {n: "武义县", l: []}, {
            n: "浦江县",
            l: []
        }, {n: "磐安县", l: []}]
    }, {
        n: "衢州市",
        l: [{n: "江山市", l: []}, {n: "常山县", l: []}, {n: "开化县", l: []}, {
            n: "龙游县",
            l: []
        }, {n: "柯城区", l: []}, {n: "衢江区", l: []}]
    }, {
        n: "丽水市",
        l: [{n: "龙泉市", l: []}, {n: "缙云县", l: []}, {n: "遂昌县", l: []}, {
            n: "松阳县",
            l: []
        }, {n: "景宁县", l: []}, {n: "云和县", l: []}, {n: "青田县", l: []}, {
            n: "庆元县",
            l: []
        }, {n: "莲都区", l: []}]
    }, {
        n: "台州市",
        l: [{n: "临海市", l: []}, {n: "三门县", l: []}, {n: "天台县", l: []}, {
            n: "仙居县",
            l: []
        }, {n: "黄岩区", l: []}, {n: "椒江区", l: []}, {n: "路桥区", l: []}, {
            n: "温岭市",
            l: []
        }, {n: "玉环县", l: []}]
    }, {
        n: "舟山市",
        l: [{n: "岱山县", l: []}, {n: "嵊泗县", l: []}, {n: "普陀区", l: []}, {n: "定海区", l: []}]
    }]
}, {
    n: "福建",
    l: [{
        n: "福州市",
        l: [{n: "长乐市", l: []}, {n: "平潭县", l: []}, {n: "连江县", l: []}, {
            n: "罗源县",
            l: []
        }, {n: "永泰县", l: []}, {n: "闽清县", l: []}, {n: "台江区", l: []}, {
            n: "鼓楼区",
            l: []
        }, {n: "晋安区", l: []}, {n: "仓山区", l: []}, {n: "马尾区", l: []}, {
            n: "福清市",
            l: []
        }, {n: "闽侯县", l: []}]
    }, {
        n: "厦门市",
        l: [{n: "思明区", l: []}, {n: "湖里区", l: []}, {n: "翔安区", l: []}, {
            n: "海沧区",
            l: []
        }, {n: "集美区", l: []}, {n: "同安区", l: []}]
    }, {
        n: "三明市",
        l: [{n: "永安市", l: []}, {n: "明溪县", l: []}, {n: "将乐县", l: []}, {
            n: "大田县",
            l: []
        }, {n: "宁化县", l: []}, {n: "建宁县", l: []}, {n: "沙县", l: []}, {
            n: "尤溪县",
            l: []
        }, {n: "清流县", l: []}, {n: "泰宁县", l: []}, {n: "梅列区", l: []}, {n: "三元区", l: []}]
    }, {
        n: "莆田市",
        l: [{n: "仙游县", l: []}, {n: "涵江区", l: []}, {n: "秀屿区", l: []}, {
            n: "城厢区",
            l: []
        }, {n: "荔城区", l: []}]
    }, {
        n: "泉州市",
        l: [{n: "石狮市", l: []}, {n: "南安市", l: []}, {n: "惠安县", l: []}, {
            n: "安溪县",
            l: []
        }, {n: "德化县", l: []}, {n: "永春县", l: []}, {n: "泉港区", l: []}, {
            n: "金门县",
            l: []
        }, {n: "洛江区", l: []}, {n: "鲤城区", l: []}, {n: "丰泽区", l: []}, {n: "晋江市", l: []}]
    }, {
        n: "漳州市",
        l: [{n: "龙海市", l: []}, {n: "平和县", l: []}, {n: "南靖县", l: []}, {
            n: "诏安县",
            l: []
        }, {n: "漳浦县", l: []}, {n: "华安县", l: []}, {n: "云霄县", l: []}, {
            n: "东山县",
            l: []
        }, {n: "长泰县", l: []}, {n: "芗城区", l: []}, {n: "龙文区", l: []}]
    }, {
        n: "南平市",
        l: [{n: "建瓯市", l: []}, {n: "邵武市", l: []}, {n: "武夷山市", l: []}, {
            n: "建阳市",
            l: []
        }, {n: "松溪县", l: []}, {n: "顺昌县", l: []}, {n: "浦城县", l: []}, {
            n: "政和县",
            l: []
        }, {n: "光泽县", l: []}, {n: "延平区", l: []}]
    }, {
        n: "龙岩市",
        l: [{n: "漳平市", l: []}, {n: "长汀县", l: []}, {n: "武平县", l: []}, {
            n: "永定县",
            l: []
        }, {n: "上杭县", l: []}, {n: "连城县", l: []}, {n: "新罗区", l: []}]
    }, {
        n: "宁德市",
        l: [{n: "福安市", l: []}, {n: "福鼎市", l: []}, {n: "寿宁县", l: []}, {
            n: "霞浦县",
            l: []
        }, {n: "柘荣县", l: []}, {n: "屏南县", l: []}, {n: "古田县", l: []}, {
            n: "周宁县",
            l: []
        }, {n: "蕉城区", l: []}, {n: "东侨开发区", l: []}]
    }]
}, {
    n: "湖北",
    l: [{
        n: "武汉市",
        l: [{n: "江岸区", l: []}, {n: "武昌区", l: []}, {n: "江汉区", l: []}, {
            n: "硚口区",
            l: []
        }, {n: "武汉经济技术开发区", l: []}, {n: "蔡甸区", l: []}, {n: "江夏区", l: []}, {
            n: "新洲区",
            l: []
        }, {n: "黄陂区", l: []}, {n: "汉阳区", l: []}, {n: "青山区", l: []}, {
            n: "洪山区",
            l: []
        }, {n: "汉南区", l: []}, {n: "东西湖区", l: []}]
    }, {
        n: "黄石市",
        l: [{n: "黄石港区", l: []}, {n: "铁山区", l: []}, {n: "大冶市", l: []}, {
            n: "阳新县",
            l: []
        }, {n: "下陆区", l: []}, {n: "西塞山区", l: []}, {n: "经济技术开发区", l: []}]
    }, {
        n: "襄阳市",
        l: [{n: "老河口市", l: []}, {n: "枣阳市", l: []}, {n: "宜城市", l: []}, {
            n: "南漳县",
            l: []
        }, {n: "保康县", l: []}, {n: "谷城县", l: []}, {n: "樊城区", l: []}, {
            n: "襄城区",
            l: []
        }, {n: "襄州区", l: []}]
    }, {
        n: "十堰市",
        l: [{n: "丹江口市", l: []}, {n: "房县", l: []}, {n: "竹山县", l: []}, {
            n: "竹溪县",
            l: []
        }, {n: "郧县", l: []}, {n: "郧西县", l: []}, {n: "茅箭区", l: []}, {n: "张湾区", l: []}]
    }, {
        n: "荆州市",
        l: [{n: "江陵县", l: []}, {n: "洪湖市", l: []}, {n: "石首市", l: []}, {
            n: "松滋市",
            l: []
        }, {n: "监利县", l: []}, {n: "公安县", l: []}, {n: "沙市区", l: []}, {n: "荆州区", l: []}]
    }, {
        n: "宜昌市",
        l: [{n: "当阳市", l: []}, {n: "枝江市", l: []}, {n: "夷陵区", l: []}, {
            n: "秭归县",
            l: []
        }, {n: "兴山县", l: []}, {n: "远安县", l: []}, {n: "五峰土家族自治县", l: []}, {
            n: "长阳土家族自治县",
            l: []
        }, {n: "宜都市", l: []}, {n: "猇亭区", l: []}, {n: "点军区", l: []}, {
            n: "伍家岗区",
            l: []
        }, {n: "西陵区", l: []}]
    }, {
        n: "孝感市",
        l: [{n: "汉川市", l: []}, {n: "云梦县", l: []}, {n: "大悟县", l: []}, {
            n: "孝昌县",
            l: []
        }, {n: "孝南区", l: []}, {n: "应城市", l: []}, {n: "安陆市", l: []}]
    }, {
        n: "黄冈市",
        l: [{n: "红安县", l: []}, {n: "罗田县", l: []}, {n: "黄梅县", l: []}, {
            n: "英山县",
            l: []
        }, {n: "团风县", l: []}, {n: "黄州区", l: []}, {n: "蕲春县", l: []}, {
            n: "麻城市",
            l: []
        }, {n: "武穴市", l: []}, {n: "浠水县", l: []}]
    }, {
        n: "咸宁市",
        l: [{n: "嘉鱼县", l: []}, {n: "通山县", l: []}, {n: "崇阳县", l: []}, {
            n: "通城县",
            l: []
        }, {n: "咸安区", l: []}, {n: "赤壁市", l: []}]
    }, {
        n: "恩施州",
        l: [{n: "恩施市", l: []}, {n: "利川市", l: []}, {n: "建始县", l: []}, {
            n: "来凤县",
            l: []
        }, {n: "巴东县", l: []}, {n: "鹤峰县", l: []}, {n: "宣恩县", l: []}, {n: "咸丰县", l: []}]
    }, {
        n: "鄂州市",
        l: [{n: "梁子湖区", l: []}, {n: "华容区", l: []}, {n: "鄂城区", l: []}]
    }, {
        n: "荆门市",
        l: [{n: "京山县", l: []}, {n: "钟祥市", l: []}, {n: "沙洋县", l: []}, {
            n: "掇刀区",
            l: []
        }, {n: "东宝区", l: []}]
    }, {n: "随州市", l: [{n: "广水市", l: []}, {n: "曾都区", l: []}, {n: "随县", l: []}]}, {
        n: "潜江市",
        l: [{n: "园林", l: []}, {n: "杨市", l: []}, {n: "周矶", l: []}, {
            n: "广华",
            l: []
        }, {n: "泰丰", l: []}, {n: "竹根滩镇", l: []}, {n: "高石碑镇", l: []}, {
            n: "积玉口镇",
            l: []
        }, {n: "渔洋镇", l: []}, {n: "王场镇", l: []}, {n: "熊口镇", l: []}, {
            n: "老新镇",
            l: []
        }, {n: "浩口镇", l: []}, {n: "张金镇", l: []}, {n: "龙湾镇", l: []}, {
            n: "江汉石油管理局",
            l: []
        }, {n: "潜江经济开发区", l: []}, {n: "西大垸管理区", l: []}, {n: "运粮湖管理区", l: []}, {
            n: "周矶管理区",
            l: []
        }, {n: "后湖管理区", l: []}, {n: "熊口管理区", l: []}, {n: "总口管理区", l: []}, {
            n: "高场原种场",
            l: []
        }, {n: "浩口原种场", l: []}]
    }, {
        n: "天门市",
        l: [{n: "侨乡街道开发区", l: []}, {n: "竟陵街道", l: []}, {n: "杨林街道", l: []}, {
            n: "佛子山镇",
            l: []
        }, {n: "多宝镇", l: []}, {n: "拖市镇", l: []}, {n: "张港镇", l: []}, {
            n: "蒋场镇",
            l: []
        }, {n: "汪场镇", l: []}, {n: "渔薪镇", l: []}, {n: "黄潭镇", l: []}, {
            n: "岳口镇",
            l: []
        }, {n: "横林镇", l: []}, {n: "彭市镇", l: []}, {n: "麻洋镇", l: []}, {
            n: "多祥镇",
            l: []
        }, {n: "干驿镇", l: []}, {n: "马湾镇", l: []}, {n: "卢市镇", l: []}, {
            n: "小板镇",
            l: []
        }, {n: "九真镇", l: []}, {n: "皂市镇", l: []}, {n: "胡市镇", l: []}, {
            n: "石河镇",
            l: []
        }, {n: "净潭乡", l: []}, {n: "蒋湖农场", l: []}, {n: "白茅湖农场", l: []}, {n: "沉湖管委会", l: []}]
    }, {
        n: "仙桃市",
        l: [{n: "郑场镇", l: []}, {n: "毛嘴镇", l: []}, {n: "豆河镇", l: []}, {
            n: "三伏潭镇",
            l: []
        }, {n: "胡场镇", l: []}, {n: "长埫口镇", l: []}, {n: "西流河镇", l: []}, {
            n: "沙湖镇",
            l: []
        }, {n: "杨林尾镇", l: []}, {n: "彭场镇", l: []}, {n: "张沟镇", l: []}, {
            n: "郭河镇",
            l: []
        }, {n: "沔城镇", l: []}, {n: "通海口镇", l: []}, {n: "陈场镇", l: []}, {
            n: "工业园区",
            l: []
        }, {n: "九合垸原种场", l: []}, {n: "沙湖原种场", l: []}, {n: "排湖渔场", l: []}, {
            n: "五湖渔场",
            l: []
        }, {n: "赵西垸林场", l: []}, {n: "刘家垸林场", l: []}, {n: "畜禽良种场", l: []}, {n: "城区", l: []}]
    }, {
        n: "神农架林区",
        l: [{n: "松柏镇", l: []}, {n: "阳日镇", l: []}, {n: "木鱼镇", l: []}, {
            n: "红坪镇",
            l: []
        }, {n: "新华镇", l: []}, {n: "宋洛乡", l: []}, {n: "九湖乡", l: []}, {n: "下谷坪乡", l: []}]
    }]
}, {
    n: "湖南",
    l: [{
        n: "长沙市",
        l: [{n: "望城区", l: []}, {n: "芙蓉区", l: []}, {n: "岳麓区", l: []}, {
            n: "雨花区",
            l: []
        }, {n: "开福区", l: []}, {n: "天心区", l: []}, {n: "浏阳市", l: []}, {
            n: "长沙县",
            l: []
        }, {n: "宁乡县", l: []}]
    }, {
        n: "株洲市",
        l: [{n: "醴陵市", l: []}, {n: "株洲县", l: []}, {n: "攸县", l: []}, {
            n: "茶陵县",
            l: []
        }, {n: "炎陵县", l: []}, {n: "天元区", l: []}, {n: "石峰区", l: []}, {
            n: "芦淞区",
            l: []
        }, {n: "荷塘区", l: []}]
    }, {
        n: "湘潭市",
        l: [{n: "湘乡市", l: []}, {n: "湘潭县", l: []}, {n: "韶山市", l: []}, {
            n: "雨湖区",
            l: []
        }, {n: "岳塘区", l: []}]
    }, {n: "韶山市", l: [{n: "韶山市区内", l: []}]}, {
        n: "衡阳市",
        l: [{n: "常宁市", l: []}, {n: "衡阳县", l: []}, {n: "耒阳市", l: []}, {
            n: "衡东县",
            l: []
        }, {n: "衡南县", l: []}, {n: "衡山县", l: []}, {n: "祁东县", l: []}, {
            n: "南岳区",
            l: []
        }, {n: "蒸湘区", l: []}, {n: "石鼓区", l: []}, {n: "珠晖区", l: []}, {n: "雁峰区", l: []}]
    }, {
        n: "邵阳市",
        l: [{n: "武冈市", l: []}, {n: "邵东县", l: []}, {n: "洞口县", l: []}, {
            n: "新邵县",
            l: []
        }, {n: "绥宁县", l: []}, {n: "新宁县", l: []}, {n: "邵阳县", l: []}, {
            n: "隆回县",
            l: []
        }, {n: "城步县", l: []}, {n: "大祥区", l: []}, {n: "双清区", l: []}, {n: "北塔区", l: []}]
    }, {
        n: "岳阳市",
        l: [{n: "临湘市", l: []}, {n: "汨罗市", l: []}, {n: "岳阳县", l: []}, {
            n: "湘阴县",
            l: []
        }, {n: "华容县", l: []}, {n: "平江县", l: []}, {n: "君山区", l: []}, {
            n: "云溪区",
            l: []
        }, {n: "岳阳楼区", l: []}]
    }, {
        n: "常德市",
        l: [{n: "津市市", l: []}, {n: "澧县", l: []}, {n: "临澧县", l: []}, {
            n: "桃源县",
            l: []
        }, {n: "汉寿县", l: []}, {n: "石门县", l: []}, {n: "安乡县", l: []}, {
            n: "鼎城区",
            l: []
        }, {n: "武陵区", l: []}]
    }, {
        n: "张家界市",
        l: [{n: "慈利县", l: []}, {n: "桑植县", l: []}, {n: "武陵源区", l: []}, {
            n: "永定区",
            l: []
        }]
    }, {
        n: "郴州市",
        l: [{n: "资兴市", l: []}, {n: "宜章县", l: []}, {n: "安仁县", l: []}, {
            n: "汝城县",
            l: []
        }, {n: "嘉禾县", l: []}, {n: "临武县", l: []}, {n: "桂东县", l: []}, {
            n: "永兴县",
            l: []
        }, {n: "桂阳县", l: []}, {n: "北湖区", l: []}, {n: "苏仙区", l: []}]
    }, {
        n: "益阳市",
        l: [{n: "南县", l: []}, {n: "桃江县", l: []}, {n: "安化县", l: []}, {
            n: "沅江市",
            l: []
        }, {n: "赫山区", l: []}, {n: "资阳区", l: []}]
    }, {
        n: "永州市",
        l: [{n: "祁阳县", l: []}, {n: "双牌县", l: []}, {n: "道县", l: []}, {
            n: "江永县",
            l: []
        }, {n: "江华县", l: []}, {n: "宁远县", l: []}, {n: "新田县", l: []}, {
            n: "蓝山县",
            l: []
        }, {n: "东安县", l: []}, {n: "零陵区", l: []}, {n: "冷水滩区", l: []}]
    }, {
        n: "怀化市",
        l: [{n: "洪江市", l: []}, {n: "会同县", l: []}, {n: "溆浦县", l: []}, {
            n: "辰溪县",
            l: []
        }, {n: "靖州县", l: []}, {n: "通道县", l: []}, {n: "芷江县", l: []}, {
            n: "新晃县",
            l: []
        }, {n: "麻阳县", l: []}, {n: "沅陵县", l: []}, {n: "中方县", l: []}, {n: "鹤城区", l: []}]
    }, {
        n: "娄底市",
        l: [{n: "冷水江市", l: []}, {n: "涟源市", l: []}, {n: "新化县", l: []}, {
            n: "双峰县",
            l: []
        }, {n: "娄星区", l: []}]
    }, {
        n: "湘西州",
        l: [{n: "吉首市", l: []}, {n: "古丈县", l: []}, {n: "龙山县", l: []}, {
            n: "永顺县",
            l: []
        }, {n: "泸溪县", l: []}, {n: "凤凰县", l: []}, {n: "花垣县", l: []}, {n: "保靖县", l: []}]
    }]
}, {
    n: "广东",
    l: [{
        n: "广州市",
        l: [{n: "天河区", l: []}, {n: "海珠区", l: []}, {n: "荔湾区", l: []}, {
            n: "越秀区",
            l: []
        }, {n: "番禺区", l: []}, {n: "花都区", l: []}, {n: "萝岗区", l: []}, {
            n: "白云区",
            l: []
        }, {n: "南沙区", l: []}, {n: "黄埔区", l: []}, {n: "增城市", l: []}, {
            n: "从化市",
            l: []
        }, {n: "广州大学城", l: []}]
    }, {
        n: "深圳市",
        l: [{n: "南山区", l: []}, {n: "罗湖区", l: []}, {n: "福田区", l: []}, {
            n: "宝安区",
            l: []
        }, {n: "光明新区", l: []}, {n: "坪山新区", l: []}, {n: "大鹏新区", l: []}, {
            n: "龙岗区",
            l: []
        }, {n: "盐田区", l: []}, {n: "龙华新区", l: []}]
    }, {
        n: "珠海市",
        l: [{n: "斗门区", l: []}, {n: "金湾区", l: []}, {n: "香洲区", l: []}]
    }, {
        n: "汕头市",
        l: [{n: "南澳县", l: []}, {n: "龙湖区", l: []}, {n: "金平区", l: []}, {
            n: "澄海区",
            l: []
        }, {n: "潮阳区", l: []}, {n: "潮南区", l: []}, {n: "濠江区", l: []}]
    }, {
        n: "韶关市",
        l: [{n: "南雄市", l: []}, {n: "乐昌市", l: []}, {n: "仁化县", l: []}, {
            n: "始兴县",
            l: []
        }, {n: "翁源县", l: []}, {n: "新丰县", l: []}, {n: "乳源瑶族自治县", l: []}, {
            n: "曲江区",
            l: []
        }, {n: "武江区", l: []}, {n: "浈江区", l: []}]
    }, {
        n: "河源市",
        l: [{n: "和平县", l: []}, {n: "龙川县", l: []}, {n: "紫金县", l: []}, {
            n: "连平县",
            l: []
        }, {n: "源城区", l: []}, {n: "东源县", l: []}]
    }, {
        n: "梅州市",
        l: [{n: "兴宁市", l: []}, {n: "梅县", l: []}, {n: "蕉岭县", l: []}, {
            n: "大埔县",
            l: []
        }, {n: "丰顺县", l: []}, {n: "五华县", l: []}, {n: "平远县", l: []}, {n: "梅江区", l: []}]
    }, {
        n: "惠州市",
        l: [{n: "龙门县", l: []}, {n: "惠阳区", l: []}, {n: "大亚湾区", l: []}, {
            n: "惠城区",
            l: []
        }, {n: "惠东县", l: []}, {n: "博罗县", l: []}]
    }, {
        n: "汕尾市",
        l: [{n: "陆河县", l: []}, {n: "海丰县", l: []}, {n: "城区", l: []}, {n: "陆丰市", l: []}]
    }, {
        n: "东莞市",
        l: [{n: "中堂镇", l: []}, {n: "东坑镇", l: []}, {n: "道滘镇", l: []}, {
            n: "沙田镇",
            l: []
        }, {n: "高埗镇", l: []}, {n: "石龙镇", l: []}, {n: "石排镇", l: []}, {
            n: "企石镇",
            l: []
        }, {n: "石碣镇", l: []}, {n: "洪梅镇", l: []}, {n: "麻涌镇", l: []}, {
            n: "桥头镇",
            l: []
        }, {n: "望牛墩镇", l: []}, {n: "茶山镇", l: []}, {n: "谢岗镇", l: []}, {
            n: "松山湖",
            l: []
        }, {n: "莞城区", l: []}, {n: "南城区", l: []}, {n: "长安镇", l: []}, {
            n: "寮步镇",
            l: []
        }, {n: "大岭山镇", l: []}, {n: "常平镇", l: []}, {n: "厚街镇", l: []}, {
            n: "万江区",
            l: []
        }, {n: "樟木头镇", l: []}, {n: "大朗镇", l: []}, {n: "塘厦镇", l: []}, {
            n: "凤岗镇",
            l: []
        }, {n: "清溪镇", l: []}, {n: "横沥镇", l: []}, {n: "东城区", l: []}, {
            n: "黄江镇",
            l: []
        }, {n: "虎门镇", l: []}]
    }, {
        n: "中山市",
        l: [{n: "南朗镇", l: []}, {n: "小榄镇", l: []}, {n: "古镇", l: []}, {
            n: "坦洲镇",
            l: []
        }, {n: "黄圃镇", l: []}, {n: "三乡镇", l: []}, {n: "东凤镇", l: []}, {
            n: "横栏镇",
            l: []
        }, {n: "三角镇", l: []}, {n: "南头镇", l: []}, {n: "沙溪镇", l: []}, {
            n: "五桂山镇",
            l: []
        }, {n: "阜沙镇", l: []}, {n: "东升镇", l: []}, {n: "板芙镇", l: []}, {
            n: "神湾镇",
            l: []
        }, {n: "港口镇", l: []}, {n: "大涌镇", l: []}, {n: "火炬开发区", l: []}, {
            n: "民众镇",
            l: []
        }, {n: "沙朗镇", l: []}, {n: "城区", l: []}]
    }, {
        n: "江门市",
        l: [{n: "台山市", l: []}, {n: "新会区", l: []}, {n: "鹤山市", l: []}, {
            n: "江海区",
            l: []
        }, {n: "蓬江区", l: []}, {n: "开平市", l: []}, {n: "恩平市", l: []}]
    }, {
        n: "佛山市",
        l: [{n: "顺德区", l: []}, {n: "禅城区", l: []}, {n: "高明区", l: []}, {
            n: "三水区",
            l: []
        }, {n: "南海区", l: []}]
    }, {
        n: "阳江市",
        l: [{n: "阳春市", l: []}, {n: "阳西县", l: []}, {n: "江城区", l: []}, {n: "阳东县", l: []}]
    }, {
        n: "湛江市",
        l: [{n: "雷州市", l: []}, {n: "吴川市", l: []}, {n: "徐闻县", l: []}, {
            n: "坡头区",
            l: []
        }, {n: "赤坎区", l: []}, {n: "霞山区", l: []}, {n: "经济技术开发区", l: []}, {
            n: "麻章区",
            l: []
        }, {n: "遂溪县", l: []}, {n: "廉江市", l: []}]
    }, {
        n: "茂名市",
        l: [{n: "信宜市", l: []}, {n: "茂南区", l: []}, {n: "电白县", l: []}, {
            n: "高州市",
            l: []
        }, {n: "化州市", l: []}, {n: "茂港区", l: []}]
    }, {
        n: "肇庆市",
        l: [{n: "广宁县", l: []}, {n: "德庆县", l: []}, {n: "怀集县", l: []}, {
            n: "封开县",
            l: []
        }, {n: "鼎湖区", l: []}, {n: "端州区", l: []}, {n: "四会市", l: []}, {n: "高要市", l: []}]
    }, {
        n: "云浮市",
        l: [{n: "云安县", l: []}, {n: "新兴县", l: []}, {n: "郁南县", l: []}, {
            n: "云城区",
            l: []
        }, {n: "罗定市", l: []}]
    }, {
        n: "清远市",
        l: [{n: "连州市", l: []}, {n: "佛冈县", l: []}, {n: "阳山县", l: []}, {
            n: "清新县",
            l: []
        }, {n: "连山县", l: []}, {n: "连南县", l: []}, {n: "清城区", l: []}, {n: "英德市", l: []}]
    }, {
        n: "潮州市",
        l: [{n: "饶平县", l: []}, {n: "枫溪区", l: []}, {n: "湘桥区", l: []}, {n: "潮安县", l: []}]
    }, {
        n: "揭阳市",
        l: [{n: "揭西县", l: []}, {n: "惠来县", l: []}, {n: "东山区", l: []}, {
            n: "普宁市",
            l: []
        }, {n: "榕城区", l: []}, {n: "揭东县", l: []}]
    }]
}, {
    n: "广西",
    l: [{
        n: "南宁市",
        l: [{n: "武鸣县", l: []}, {n: "邕宁区", l: []}, {n: "宾阳县", l: []}, {
            n: "横县",
            l: []
        }, {n: "上林县", l: []}, {n: "隆安县", l: []}, {n: "马山县", l: []}, {
            n: "良庆区",
            l: []
        }, {n: "江南区", l: []}, {n: "兴宁区", l: []}, {n: "青秀区", l: []}, {n: "西乡塘区", l: []}]
    }, {
        n: "柳州市",
        l: [{n: "柳江县", l: []}, {n: "柳城县", l: []}, {n: "鹿寨县", l: []}, {
            n: "融安县",
            l: []
        }, {n: "三江县", l: []}, {n: "融水县", l: []}, {n: "鱼峰区", l: []}, {
            n: "城中区",
            l: []
        }, {n: "柳南区", l: []}, {n: "柳北区", l: []}]
    }, {
        n: "桂林市",
        l: [{n: "阳朔县", l: []}, {n: "临桂县", l: []}, {n: "灵川县", l: []}, {
            n: "全州县",
            l: []
        }, {n: "平乐县", l: []}, {n: "兴安县", l: []}, {n: "灌阳县", l: []}, {
            n: "荔浦县",
            l: []
        }, {n: "资源县", l: []}, {n: "永福县", l: []}, {n: "龙胜县", l: []}, {
            n: "恭城县",
            l: []
        }, {n: "象山区", l: []}, {n: "雁山区", l: []}, {n: "秀峰区", l: []}, {
            n: "叠彩区",
            l: []
        }, {n: "七星区", l: []}]
    }, {
        n: "梧州市",
        l: [{n: "岑溪市", l: []}, {n: "苍梧县", l: []}, {n: "藤县", l: []}, {
            n: "蒙山县",
            l: []
        }, {n: "万秀区", l: []}, {n: "蝶山区", l: []}, {n: "长洲区", l: []}]
    }, {
        n: "北海市",
        l: [{n: "合浦县", l: []}, {n: "铁山港区", l: []}, {n: "海城区", l: []}, {
            n: "银海区",
            l: []
        }]
    }, {
        n: "防城港市",
        l: [{n: "东兴市", l: []}, {n: "上思县", l: []}, {n: "防城区", l: []}, {n: "港口区", l: []}]
    }, {
        n: "钦州市",
        l: [{n: "浦北县", l: []}, {n: "灵山县", l: []}, {n: "钦北区", l: []}, {n: "钦南区", l: []}]
    }, {
        n: "贵港市",
        l: [{n: "桂平市", l: []}, {n: "平南县", l: []}, {n: "覃塘区", l: []}, {
            n: "港南区",
            l: []
        }, {n: "港北区", l: []}]
    }, {
        n: "玉林市",
        l: [{n: "北流市", l: []}, {n: "容县", l: []}, {n: "博白县", l: []}, {
            n: "陆川县",
            l: []
        }, {n: "兴业县", l: []}, {n: "玉州区", l: []}]
    }, {
        n: "贺州市",
        l: [{n: "钟山县", l: []}, {n: "昭平县", l: []}, {n: "富川县", l: []}, {
            n: "平桂管理区",
            l: []
        }, {n: "八步区", l: []}]
    }, {
        n: "百色市",
        l: [{n: "右江区", l: []}, {n: "平果县", l: []}, {n: "乐业县", l: []}, {
            n: "田阳县",
            l: []
        }, {n: "西林县", l: []}, {n: "田林县", l: []}, {n: "德保县", l: []}, {
            n: "靖西县",
            l: []
        }, {n: "田东县", l: []}, {n: "那坡县", l: []}, {n: "隆林县", l: []}, {n: "凌云县", l: []}]
    }, {
        n: "河池市",
        l: [{n: "宜州市", l: []}, {n: "天峨县", l: []}, {n: "凤山县", l: []}, {
            n: "南丹县",
            l: []
        }, {n: "东兰县", l: []}, {n: "巴马县", l: []}, {n: "环江县", l: []}, {
            n: "罗城县",
            l: []
        }, {n: "大化县", l: []}, {n: "都安县", l: []}, {n: "金城江区", l: []}]
    }, {
        n: "来宾市",
        l: [{n: "兴宾区", l: []}, {n: "合山市", l: []}, {n: "忻城县", l: []}, {
            n: "武宣县",
            l: []
        }, {n: "象州县", l: []}, {n: "金秀县", l: []}]
    }, {
        n: "崇左市",
        l: [{n: "江州区", l: []}, {n: "凭祥市", l: []}, {n: "扶绥县", l: []}, {
            n: "大新县",
            l: []
        }, {n: "天等县", l: []}, {n: "宁明县", l: []}, {n: "龙州县", l: []}]
    }]
}, {
    n: "江西",
    l: [{
        n: "南昌市",
        l: [{n: "南昌县", l: []}, {n: "进贤县", l: []}, {n: "安义县", l: []}, {
            n: "新建县",
            l: []
        }, {n: "湾里区", l: []}, {n: "青云谱区", l: []}, {n: "西湖区", l: []}, {
            n: "东湖区",
            l: []
        }, {n: "高新区", l: []}, {n: "昌北区", l: []}, {n: "青山湖区", l: []}, {n: "红谷滩新区", l: []}]
    }, {
        n: "景德镇市",
        l: [{n: "乐平市", l: []}, {n: "浮梁县", l: []}, {n: "珠山区", l: []}, {n: "昌江区", l: []}]
    }, {
        n: "萍乡市",
        l: [{n: "湘东区", l: []}, {n: "莲花县", l: []}, {n: "上栗县", l: []}, {
            n: "芦溪县",
            l: []
        }, {n: "安源区", l: []}]
    }, {n: "新余市", l: [{n: "分宜县", l: []}, {n: "渝水区", l: []}]}, {
        n: "九江市",
        l: [{n: "九江县", l: []}, {n: "瑞昌市", l: []}, {n: "星子县", l: []}, {
            n: "武宁县",
            l: []
        }, {n: "彭泽县", l: []}, {n: "永修县", l: []}, {n: "修水县", l: []}, {
            n: "湖口县",
            l: []
        }, {n: "德安县", l: []}, {n: "都昌县", l: []}, {n: "共青城市", l: []}, {
            n: "经济技术开发区",
            l: []
        }, {n: "八里湖新区", l: []}, {n: "庐山风景名胜区", l: []}, {n: "庐山区", l: []}, {n: "浔阳区", l: []}]
    }, {
        n: "鹰潭市",
        l: [{n: "余江县", l: []}, {n: "贵溪市", l: []}, {n: "月湖区", l: []}, {
            n: "龙虎山风景旅游区",
            l: []
        }]
    }, {
        n: "上饶市",
        l: [{n: "德兴市", l: []}, {n: "广丰县", l: []}, {n: "鄱阳县", l: []}, {
            n: "婺源县",
            l: []
        }, {n: "余干县", l: []}, {n: "横峰县", l: []}, {n: "弋阳县", l: []}, {
            n: "铅山县",
            l: []
        }, {n: "玉山县", l: []}, {n: "万年县", l: []}, {n: "信州区", l: []}, {n: "上饶县", l: []}]
    }, {
        n: "宜春市",
        l: [{n: "丰城市", l: []}, {n: "樟树市", l: []}, {n: "高安市", l: []}, {
            n: "铜鼓县",
            l: []
        }, {n: "靖安县", l: []}, {n: "宜丰县", l: []}, {n: "奉新县", l: []}, {
            n: "万载县",
            l: []
        }, {n: "上高县", l: []}, {n: "袁州区", l: []}]
    }, {
        n: "抚州市",
        l: [{n: "南丰县", l: []}, {n: "乐安县", l: []}, {n: "金溪县", l: []}, {
            n: "南城县",
            l: []
        }, {n: "东乡县", l: []}, {n: "资溪县", l: []}, {n: "宜黄县", l: []}, {
            n: "崇仁县",
            l: []
        }, {n: "黎川县", l: []}, {n: "广昌县", l: []}, {n: "临川区", l: []}]
    }, {
        n: "吉安市",
        l: [{n: "井冈山市", l: []}, {n: "吉安县", l: []}, {n: "永丰县", l: []}, {
            n: "永新县",
            l: []
        }, {n: "新干县", l: []}, {n: "泰和县", l: []}, {n: "峡江县", l: []}, {
            n: "遂川县",
            l: []
        }, {n: "安福县", l: []}, {n: "吉水县", l: []}, {n: "万安县", l: []}, {
            n: "青原区",
            l: []
        }, {n: "吉州区", l: []}]
    }, {
        n: "赣州市",
        l: [{n: "南康市", l: []}, {n: "瑞金市", l: []}, {n: "石城县", l: []}, {
            n: "安远县",
            l: []
        }, {n: "赣县", l: []}, {n: "宁都县", l: []}, {n: "寻乌县", l: []}, {
            n: "兴国县",
            l: []
        }, {n: "定南县", l: []}, {n: "上犹县", l: []}, {n: "于都县", l: []}, {
            n: "龙南县",
            l: []
        }, {n: "崇义县", l: []}, {n: "大余县", l: []}, {n: "信丰县", l: []}, {
            n: "全南县",
            l: []
        }, {n: "会昌县", l: []}, {n: "章贡区", l: []}]
    }]
}, {
    n: "四川",
    l: [{
        n: "成都市",
        l: [{n: "高新西区", l: []}, {n: "新都区", l: []}, {n: "温江区", l: []}, {
            n: "龙泉驿区",
            l: []
        }, {n: "青白江区", l: []}, {n: "彭州市", l: []}, {n: "崇州市", l: []}, {
            n: "邛崃市",
            l: []
        }, {n: "都江堰市", l: []}, {n: "郫县", l: []}, {n: "新津县", l: []}, {
            n: "双流县",
            l: []
        }, {n: "大邑县", l: []}, {n: "蒲江县", l: []}, {n: "金堂县", l: []}, {
            n: "青羊区",
            l: []
        }, {n: "锦江区", l: []}, {n: "金牛区", l: []}, {n: "武侯区", l: []}, {
            n: "成华区",
            l: []
        }, {n: "高新区", l: []}]
    }, {
        n: "自贡市",
        l: [{n: "荣县", l: []}, {n: "富顺县", l: []}, {n: "自流井区", l: []}, {
            n: "沿滩区",
            l: []
        }, {n: "大安区", l: []}, {n: "贡井区", l: []}]
    }, {
        n: "攀枝花市",
        l: [{n: "米易县", l: []}, {n: "盐边县", l: []}, {n: "仁和区", l: []}, {
            n: "西区",
            l: []
        }, {n: "东区", l: []}]
    }, {
        n: "泸州市",
        l: [{n: "泸县", l: []}, {n: "合江县", l: []}, {n: "叙永县", l: []}, {
            n: "古蔺县",
            l: []
        }, {n: "纳溪区", l: []}, {n: "江阳区", l: []}, {n: "龙马潭区", l: []}]
    }, {
        n: "绵阳市",
        l: [{n: "盐亭县", l: []}, {n: "三台县", l: []}, {n: "平武县", l: []}, {
            n: "北川县",
            l: []
        }, {n: "安县", l: []}, {n: "梓潼县", l: []}, {n: "江油市", l: []}, {
            n: "涪城区",
            l: []
        }, {n: "游仙区", l: []}, {n: "高新区", l: []}, {n: "经开区", l: []}]
    }, {
        n: "德阳市",
        l: [{n: "罗江县", l: []}, {n: "中江县", l: []}, {n: "广汉市", l: []}, {
            n: "什邡市",
            l: []
        }, {n: "旌阳区", l: []}, {n: "绵竹市", l: []}]
    }, {
        n: "广元市",
        l: [{n: "青川县", l: []}, {n: "旺苍县", l: []}, {n: "剑阁县", l: []}, {
            n: "苍溪县",
            l: []
        }, {n: "元坝区", l: []}, {n: "朝天区", l: []}, {n: "利州区", l: []}]
    }, {
        n: "遂宁市",
        l: [{n: "射洪县", l: []}, {n: "蓬溪县", l: []}, {n: "大英县", l: []}, {
            n: "安居区",
            l: []
        }, {n: "船山区", l: []}]
    }, {
        n: "内江市",
        l: [{n: "资中县", l: []}, {n: "隆昌县", l: []}, {n: "威远县", l: []}, {
            n: "市中区",
            l: []
        }, {n: "东兴区", l: []}]
    }, {
        n: "乐山市",
        l: [{n: "五通桥区", l: []}, {n: "沙湾区", l: []}, {n: "金口河区", l: []}, {
            n: "夹江县",
            l: []
        }, {n: "井研县", l: []}, {n: "犍为县", l: []}, {n: "沐川县", l: []}, {
            n: "峨边县",
            l: []
        }, {n: "马边县", l: []}, {n: "市中区", l: []}, {n: "峨眉山市", l: []}]
    }, {
        n: "宜宾市",
        l: [{n: "宜宾县", l: []}, {n: "南溪区", l: []}, {n: "江安县", l: []}, {
            n: "长宁县",
            l: []
        }, {n: "兴文县", l: []}, {n: "珙县", l: []}, {n: "高县", l: []}, {
            n: "屏山县",
            l: []
        }, {n: "筠连县", l: []}, {n: "翠屏区", l: []}]
    }, {
        n: "广安市",
        l: [{n: "岳池县", l: []}, {n: "武胜县", l: []}, {n: "邻水县", l: []}, {
            n: "广安区",
            l: []
        }, {n: "华蓥市", l: []}]
    }, {
        n: "南充市",
        l: [{n: "仪陇县", l: []}, {n: "蓬安县", l: []}, {n: "营山县", l: []}, {
            n: "南部县",
            l: []
        }, {n: "顺庆区", l: []}, {n: "高坪区", l: []}, {n: "嘉陵区", l: []}, {
            n: "西充县",
            l: []
        }, {n: "阆中市", l: []}]
    }, {
        n: "达州市",
        l: [{n: "通川区", l: []}, {n: "达县", l: []}, {n: "大竹县", l: []}, {
            n: "渠县",
            l: []
        }, {n: "万源市", l: []}, {n: "宣汉县", l: []}, {n: "开江县", l: []}]
    }, {
        n: "巴中市",
        l: [{n: "南江县", l: []}, {n: "平昌县", l: []}, {n: "通江县", l: []}, {n: "巴州区", l: []}]
    }, {
        n: "雅安市",
        l: [{n: "芦山县", l: []}, {n: "石棉县", l: []}, {n: "名山区", l: []}, {
            n: "天全县",
            l: []
        }, {n: "荥经县", l: []}, {n: "汉源县", l: []}, {n: "宝兴县", l: []}, {n: "雨城区", l: []}]
    }, {
        n: "眉山市",
        l: [{n: "仁寿县", l: []}, {n: "彭山县", l: []}, {n: "洪雅县", l: []}, {
            n: "丹棱县",
            l: []
        }, {n: "青神县", l: []}, {n: "东坡区", l: []}]
    }, {
        n: "资阳市",
        l: [{n: "安岳县", l: []}, {n: "乐至县", l: []}, {n: "雁江区", l: []}, {n: "简阳市", l: []}]
    }, {
        n: "阿坝州",
        l: [{n: "马尔康县", l: []}, {n: "九寨沟县", l: []}, {n: "红原县", l: []}, {
            n: "阿坝县",
            l: []
        }, {n: "理县", l: []}, {n: "若尔盖县", l: []}, {n: "金川县", l: []}, {
            n: "小金县",
            l: []
        }, {n: "黑水县", l: []}, {n: "松潘县", l: []}, {n: "壤塘县", l: []}, {
            n: "茂县",
            l: []
        }, {n: "汶川县", l: []}]
    }, {
        n: "甘孜州",
        l: [{n: "康定县", l: []}, {n: "泸定县", l: []}, {n: "九龙县", l: []}, {
            n: "丹巴县",
            l: []
        }, {n: "道孚县", l: []}, {n: "炉霍县", l: []}, {n: "色达县", l: []}, {
            n: "甘孜县",
            l: []
        }, {n: "新龙县", l: []}, {n: "白玉县", l: []}, {n: "德格县", l: []}, {
            n: "石渠县",
            l: []
        }, {n: "雅江县", l: []}, {n: "理塘县", l: []}, {n: "巴塘县", l: []}, {
            n: "稻城县",
            l: []
        }, {n: "乡城县", l: []}, {n: "得荣县", l: []}]
    }, {
        n: "凉山州",
        l: [{n: "美姑县", l: []}, {n: "昭觉县", l: []}, {n: "会理县", l: []}, {
            n: "会东县",
            l: []
        }, {n: "普格县", l: []}, {n: "宁南县", l: []}, {n: "德昌县", l: []}, {
            n: "冕宁县",
            l: []
        }, {n: "盐源县", l: []}, {n: "金阳县", l: []}, {n: "布拖县", l: []}, {
            n: "雷波县",
            l: []
        }, {n: "越西县", l: []}, {n: "喜德县", l: []}, {n: "甘洛县", l: []}, {
            n: "木里县",
            l: []
        }, {n: "西昌市", l: []}]
    }]
}, {
    n: "海南",
    l: [{
        n: "海口市",
        l: [{n: "秀英区", l: []}, {n: "龙华区", l: []}, {n: "琼山区", l: []}, {n: "美兰区", l: []}]
    }, {
        n: "儋州市",
        l: [{n: "那大镇", l: []}, {n: "和庆镇", l: []}, {n: "南丰镇", l: []}, {
            n: "大成镇",
            l: []
        }, {n: "雅星镇", l: []}, {n: "兰洋镇", l: []}, {n: "光村镇", l: []}, {
            n: "木棠镇",
            l: []
        }, {n: "海头镇", l: []}, {n: "峨蔓镇", l: []}, {n: "三都镇", l: []}, {
            n: "王五镇",
            l: []
        }, {n: "白马井镇", l: []}, {n: "中和镇", l: []}, {n: "排浦镇", l: []}, {
            n: "东成镇",
            l: []
        }, {n: "新州镇", l: []}, {n: "洋浦经济开发区", l: []}, {n: "富克镇", l: []}, {
            n: "西培农场",
            l: []
        }, {n: "西联农场", l: []}, {n: "蓝洋农场", l: []}, {n: "八一农场", l: []}, {
            n: "西华农场",
            l: []
        }, {n: "西庆农场", l: []}, {n: "西流农场", l: []}, {n: "新盈农场", l: []}, {
            n: "龙山农场",
            l: []
        }, {n: "红岭农场", l: []}, {n: "热作学院", l: []}]
    }, {
        n: "琼海市",
        l: [{n: "嘉积镇", l: []}, {n: "万泉镇", l: []}, {n: "石壁镇", l: []}, {
            n: "中原镇",
            l: []
        }, {n: "博鳌镇", l: []}, {n: "阳江镇", l: []}, {n: "龙江镇", l: []}, {
            n: "潭门镇",
            l: []
        }, {n: "塔洋镇", l: []}, {n: "长坡镇", l: []}, {n: "大路镇", l: []}, {
            n: "会山镇",
            l: []
        }, {n: "彬村山华侨农场", l: []}, {n: "东太农场", l: []}, {n: "东红农场", l: []}, {
            n: "东升农场",
            l: []
        }, {n: "南俸农场", l: []}]
    }, {
        n: "万宁市",
        l: [{n: "万城镇", l: []}, {n: "龙滚镇", l: []}, {n: "和乐镇", l: []}, {
            n: "后安镇",
            l: []
        }, {n: "大茂镇", l: []}, {n: "东澳镇", l: []}, {n: "礼纪镇", l: []}, {
            n: "长丰镇",
            l: []
        }, {n: "山根镇", l: []}, {n: "北大镇", l: []}, {n: "南桥镇", l: []}, {
            n: "三更罗镇",
            l: []
        }, {n: "六连林场", l: []}, {n: "东兴农场", l: []}, {n: "东和农场", l: []}, {
            n: "新中农场",
            l: []
        }, {n: "兴隆华侨农场", l: []}]
    }, {
        n: "东方市",
        l: [{n: "八所镇", l: []}, {n: "东河镇", l: []}, {n: "大田镇", l: []}, {
            n: "感城镇",
            l: []
        }, {n: "板桥镇", l: []}, {n: "三家镇", l: []}, {n: "四更镇", l: []}, {
            n: "新龙镇",
            l: []
        }, {n: "天安乡", l: []}, {n: "江边乡", l: []}, {n: "广坝农场", l: []}, {n: "东方华侨农场", l: []}]
    }, {
        n: "三亚市",
        l: [{n: "海棠湾镇", l: []}, {n: "吉阳镇", l: []}, {n: "凤凰镇", l: []}, {
            n: "天涯镇",
            l: []
        }, {n: "育才镇", l: []}, {n: "崖城镇", l: []}, {n: "河西区", l: []}, {
            n: "河东区",
            l: []
        }, {n: "南田农场", l: []}, {n: "南新农场", l: []}, {n: "南岛农场", l: []}, {
            n: "立才农场",
            l: []
        }, {n: "南滨农场", l: []}]
    }, {
        n: "文昌市",
        l: [{n: "文城镇", l: []}, {n: "重兴镇", l: []}, {n: "蓬莱镇", l: []}, {
            n: "会文镇",
            l: []
        }, {n: "东路镇", l: []}, {n: "潭牛镇", l: []}, {n: "东阁镇", l: []}, {
            n: "文教镇",
            l: []
        }, {n: "东郊镇", l: []}, {n: "龙楼镇", l: []}, {n: "昌洒镇", l: []}, {
            n: "翁田镇",
            l: []
        }, {n: "抱罗镇", l: []}, {n: "冯坡镇", l: []}, {n: "锦山镇", l: []}, {
            n: "铺前镇",
            l: []
        }, {n: "公坡镇", l: []}, {n: "迈号镇", l: []}, {n: "清谰镇", l: []}, {
            n: "南阳镇",
            l: []
        }, {n: "新桥镇", l: []}, {n: "头苑镇", l: []}, {n: "宝芳乡", l: []}, {
            n: "龙马乡",
            l: []
        }, {n: "湖山乡", l: []}, {n: "东路农场", l: []}, {n: "南阳农场", l: []}, {
            n: "罗豆农场",
            l: []
        }, {n: "橡胶研究所", l: []}]
    }, {
        n: "五指山市",
        l: [{n: "通什镇", l: []}, {n: "南圣镇", l: []}, {n: "毛阳镇", l: []}, {
            n: "番阳镇",
            l: []
        }, {n: "畅好乡", l: []}, {n: "毛道乡", l: []}, {n: "水满乡", l: []}, {n: "畅好农场", l: []}]
    }, {
        n: "临高县",
        l: [{n: "临城镇", l: []}, {n: "波莲镇", l: []}, {n: "东英镇", l: []}, {
            n: "博厚镇",
            l: []
        }, {n: "皇桐镇", l: []}, {n: "多文镇", l: []}, {n: "和舍镇", l: []}, {
            n: "南宝镇",
            l: []
        }, {n: "新盈镇", l: []}, {n: "调楼镇", l: []}, {n: "加来镇", l: []}, {
            n: "红华农场",
            l: []
        }, {n: "加来农场", l: []}, {n: "城区", l: []}]
    }, {
        n: "澄迈县",
        l: [{n: "金江镇", l: []}, {n: "老城镇", l: []}, {n: "瑞溪镇", l: []}, {
            n: "永发镇",
            l: []
        }, {n: "加乐镇", l: []}, {n: "文儒镇", l: []}, {n: "中兴镇", l: []}, {
            n: "仁兴镇",
            l: []
        }, {n: "福山镇", l: []}, {n: "桥头镇", l: []}, {n: "大丰镇", l: []}, {
            n: "红光农场",
            l: []
        }, {n: "西达农场", l: []}, {n: "金安农场", l: []}, {n: "城区", l: []}]
    }, {
        n: "定安县",
        l: [{n: "定城镇", l: []}, {n: "新竹镇", l: []}, {n: "龙湖镇", l: []}, {
            n: "雷鸣镇",
            l: []
        }, {n: "龙门镇", l: []}, {n: "龙河镇", l: []}, {n: "岭口镇", l: []}, {
            n: "翰林镇",
            l: []
        }, {n: "富文镇", l: []}, {n: "黄竹镇", l: []}, {n: "金鸡岭农场", l: []}, {
            n: "中瑞农场",
            l: []
        }, {n: "南海农场", l: []}, {n: "城区", l: []}]
    }, {
        n: "屯昌县",
        l: [{n: "屯城镇", l: []}, {n: "新兴镇", l: []}, {n: "枫木镇", l: []}, {
            n: "乌坡镇",
            l: []
        }, {n: "南吕镇", l: []}, {n: "南坤镇", l: []}, {n: "坡心镇", l: []}, {
            n: "西昌镇",
            l: []
        }, {n: "中建农场", l: []}, {n: "中坤农场", l: []}, {n: "县城内", l: []}]
    }, {
        n: "昌江县",
        l: [{n: "石碌镇", l: []}, {n: "叉河镇", l: []}, {n: "十月田镇", l: []}, {
            n: "乌烈镇",
            l: []
        }, {n: "昌化镇", l: []}, {n: "海尾镇", l: []}, {n: "七叉镇", l: []}, {
            n: "王下乡",
            l: []
        }, {n: "海南矿业公司", l: []}, {n: "霸王岭林场", l: []}, {n: "红林农场", l: []}, {n: "城区", l: []}]
    }, {
        n: "白沙县",
        l: [{n: "牙叉镇", l: []}, {n: "七坊镇", l: []}, {n: "邦溪镇", l: []}, {
            n: "打安镇",
            l: []
        }, {n: "细水乡", l: []}, {n: "元门乡", l: []}, {n: "南开乡", l: []}, {
            n: "阜龙乡",
            l: []
        }, {n: "青松乡", l: []}, {n: "金波乡", l: []}, {n: "荣邦乡", l: []}, {
            n: "白沙农场",
            l: []
        }, {n: "龙江农场", l: []}, {n: "邦溪农场", l: []}, {n: "城区", l: []}]
    }, {
        n: "琼中县",
        l: [{n: "营根镇", l: []}, {n: "湾岭镇", l: []}, {n: "黎母山镇", l: []}, {
            n: "和平镇",
            l: []
        }, {n: "长征镇", l: []}, {n: "红毛镇", l: []}, {n: "中平镇", l: []}, {
            n: "上安乡",
            l: []
        }, {n: "什运乡", l: []}, {n: "吊罗山乡", l: []}, {n: "黎母山林业公司", l: []}, {
            n: "阳江农场",
            l: []
        }, {n: "乌石农场", l: []}, {n: "加钗农场", l: []}, {n: "长征农场", l: []}, {n: "城区", l: []}]
    }, {
        n: "陵水县",
        l: [{n: "椰林镇", l: []}, {n: "光坡镇", l: []}, {n: "三才镇", l: []}, {
            n: "英州镇",
            l: []
        }, {n: "隆广镇", l: []}, {n: "文罗镇", l: []}, {n: "本号镇", l: []}, {
            n: "新村镇",
            l: []
        }, {n: "黎安镇", l: []}, {n: "提蒙乡", l: []}, {n: "群英乡", l: []}, {
            n: "吊罗山林业公司",
            l: []
        }, {n: "岭门农场", l: []}, {n: "南平农场", l: []}, {n: "城区", l: []}]
    }, {
        n: "保亭县",
        l: [{n: "保城镇", l: []}, {n: "什玲镇", l: []}, {n: "加茂镇", l: []}, {
            n: "响水镇",
            l: []
        }, {n: "新政镇", l: []}, {n: "三道镇", l: []}, {n: "六弓乡", l: []}, {
            n: "南林乡",
            l: []
        }, {n: "毛感乡", l: []}, {n: "保亭研究所", l: []}, {n: "新星农场", l: []}, {
            n: "金江农场",
            l: []
        }, {n: "三道农场", l: []}]
    }, {
        n: "乐东县",
        l: [{n: "抱由镇", l: []}, {n: "万冲镇", l: []}, {n: "大安镇", l: []}, {
            n: "志仲镇",
            l: []
        }, {n: "千家镇", l: []}, {n: "九所镇", l: []}, {n: "利国镇", l: []}, {
            n: "黄流镇",
            l: []
        }, {n: "佛罗镇", l: []}, {n: "尖峰镇", l: []}, {n: "莺歌海镇", l: []}, {
            n: "尖峰岭林业公司",
            l: []
        }, {n: "莺歌海盐场", l: []}, {n: "山荣农场", l: []}, {n: "乐光农场", l: []}, {
            n: "保国农场",
            l: []
        }, {n: "城区", l: []}]
    }, {n: "三沙市", l: [{n: "西沙群岛", l: []}, {n: "南沙群岛", l: []}, {n: "中沙群岛", l: []}]}]
}, {
    n: "贵州",
    l: [{
        n: "贵阳市",
        l: [{n: "清镇市", l: []}, {n: "开阳县", l: []}, {n: "修文县", l: []}, {
            n: "息烽县",
            l: []
        }, {n: "乌当区", l: []}, {n: "南明区", l: []}, {n: "白云区", l: []}, {
            n: "云岩区",
            l: []
        }, {n: "花溪区", l: []}, {n: "小河区", l: []}, {n: "观山湖区", l: []}]
    }, {
        n: "六盘水市",
        l: [{n: "盘县", l: []}, {n: "六枝特区", l: []}, {n: "水城县", l: []}, {n: "钟山区", l: []}]
    }, {
        n: "遵义市",
        l: [{n: "赤水市", l: []}, {n: "仁怀市", l: []}, {n: "遵义县", l: []}, {
            n: "桐梓县",
            l: []
        }, {n: "绥阳县", l: []}, {n: "习水县", l: []}, {n: "凤冈县", l: []}, {
            n: "正安县",
            l: []
        }, {n: "湄潭县", l: []}, {n: "余庆县", l: []}, {n: "道真县", l: []}, {
            n: "务川县",
            l: []
        }, {n: "红花岗区", l: []}, {n: "汇川区", l: []}]
    }, {
        n: "铜仁市",
        l: [{n: "碧江区", l: []}, {n: "德江县", l: []}, {n: "江口县", l: []}, {
            n: "思南县",
            l: []
        }, {n: "万山区", l: []}, {n: "石阡县", l: []}, {n: "玉屏侗族自治县", l: []}, {
            n: "松桃苗族自治县",
            l: []
        }, {n: "印江土家族苗族自治县", l: []}, {n: "沿河土家族自治县", l: []}]
    }, {
        n: "毕节市",
        l: [{n: "黔西县", l: []}, {n: "大方县", l: []}, {n: "织金县", l: []}, {
            n: "金沙县",
            l: []
        }, {n: "赫章县", l: []}, {n: "纳雍县", l: []}, {n: "威宁彝族回族苗族自治县", l: []}, {
            n: "七星关区",
            l: []
        }]
    }, {
        n: "安顺市",
        l: [{n: "西秀区", l: []}, {n: "普定县", l: []}, {n: "平坝县", l: []}, {
            n: "镇宁布依族苗族自治县",
            l: []
        }, {n: "关岭布依族苗族自治县", l: []}, {n: "紫云苗族布依族自治县", l: []}]
    }, {
        n: "黔西南州",
        l: [{n: "兴义市", l: []}, {n: "望谟县", l: []}, {n: "兴仁县", l: []}, {
            n: "普安县",
            l: []
        }, {n: "册亨县", l: []}, {n: "晴隆县", l: []}, {n: "贞丰县", l: []}, {n: "安龙县", l: []}]
    }, {
        n: "黔东南州",
        l: [{n: "凯里市", l: []}, {n: "施秉市", l: []}, {n: "从江县", l: []}, {
            n: "锦屏县",
            l: []
        }, {n: "镇远县", l: []}, {n: "麻江县", l: []}, {n: "台江县", l: []}, {
            n: "天柱县",
            l: []
        }, {n: "黄平县", l: []}, {n: "榕江县", l: []}, {n: "剑河县", l: []}, {
            n: "三穗县",
            l: []
        }, {n: "雷山县", l: []}, {n: "黎平县", l: []}, {n: "岑巩县", l: []}, {n: "丹寨县", l: []}]
    }, {
        n: "黔南州",
        l: [{n: "都匀市", l: []}, {n: "福泉市", l: []}, {n: "贵定县", l: []}, {
            n: "惠水县",
            l: []
        }, {n: "罗甸县", l: []}, {n: "瓮安县", l: []}, {n: "荔波县", l: []}, {
            n: "龙里县",
            l: []
        }, {n: "平塘县", l: []}, {n: "长顺县", l: []}, {n: "独山县", l: []}, {n: "三都县", l: []}]
    }]
}, {
    n: "云南",
    l: [{
        n: "昆明市",
        l: [{n: "东川区", l: []}, {n: "安宁市", l: []}, {n: "富民县", l: []}, {
            n: "嵩明县",
            l: []
        }, {n: "晋宁县", l: []}, {n: "宜良县", l: []}, {n: "禄劝县", l: []}, {
            n: "石林县",
            l: []
        }, {n: "寻甸县", l: []}, {n: "盘龙区", l: []}, {n: "五华区", l: []}, {
            n: "官渡区",
            l: []
        }, {n: "西山区", l: []}, {n: "呈贡区", l: []}]
    }, {
        n: "曲靖市",
        l: [{n: "马龙县", l: []}, {n: "宣威市", l: []}, {n: "富源县", l: []}, {
            n: "会泽县",
            l: []
        }, {n: "陆良县", l: []}, {n: "师宗县", l: []}, {n: "罗平县", l: []}, {
            n: "沾益县",
            l: []
        }, {n: "麒麟区", l: []}]
    }, {
        n: "玉溪市",
        l: [{n: "红塔区", l: []}, {n: "华宁县", l: []}, {n: "澄江县", l: []}, {
            n: "易门县",
            l: []
        }, {n: "通海县", l: []}, {n: "江川县", l: []}, {n: "元江县", l: []}, {
            n: "新平县",
            l: []
        }, {n: "峨山县", l: []}]
    }, {
        n: "昭通市",
        l: [{n: "昭阳区", l: []}, {n: "镇雄县", l: []}, {n: "永善县", l: []}, {
            n: "大关县",
            l: []
        }, {n: "盐津县", l: []}, {n: "彝良县", l: []}, {n: "水富县", l: []}, {
            n: "巧家县",
            l: []
        }, {n: "威信县", l: []}, {n: "鲁甸县", l: []}, {n: "绥江县", l: []}]
    }, {
        n: "普洱市",
        l: [{n: "思茅区", l: []}, {n: "宁洱县", l: []}, {n: "景东县", l: []}, {
            n: "镇沅县",
            l: []
        }, {n: "景谷县", l: []}, {n: "墨江县", l: []}, {n: "澜沧县", l: []}, {
            n: "西盟县",
            l: []
        }, {n: "江城县", l: []}, {n: "孟连县", l: []}]
    }, {
        n: "临沧市",
        l: [{n: "临翔区", l: []}, {n: "镇康县", l: []}, {n: "凤庆县", l: []}, {
            n: "云县",
            l: []
        }, {n: "永德县", l: []}, {n: "耿马县", l: []}, {n: "双江县", l: []}, {n: "沧源县", l: []}]
    }, {
        n: "保山市",
        l: [{n: "隆阳区", l: []}, {n: "施甸县", l: []}, {n: "昌宁县", l: []}, {
            n: "龙陵县",
            l: []
        }, {n: "腾冲县", l: []}]
    }, {
        n: "丽江市",
        l: [{n: "玉龙县", l: []}, {n: "华坪县", l: []}, {n: "永胜县", l: []}, {
            n: "宁蒗县",
            l: []
        }, {n: "古城区", l: []}]
    }, {
        n: "文山州",
        l: [{n: "文山市", l: []}, {n: "麻栗坡县", l: []}, {n: "砚山县", l: []}, {
            n: "广南县",
            l: []
        }, {n: "马关县", l: []}, {n: "富宁县", l: []}, {n: "西畴县", l: []}, {n: "丘北县", l: []}]
    }, {
        n: "红河州",
        l: [{n: "个旧市", l: []}, {n: "开远市", l: []}, {n: "弥勒县", l: []}, {
            n: "红河县",
            l: []
        }, {n: "绿春县", l: []}, {n: "蒙自市", l: []}, {n: "泸西县", l: []}, {
            n: "建水县",
            l: []
        }, {n: "元阳县", l: []}, {n: "石屏县", l: []}, {n: "金平县", l: []}, {
            n: "屏边县",
            l: []
        }, {n: "河口县", l: []}]
    }, {
        n: "西双版纳州",
        l: [{n: "景洪市", l: []}, {n: "勐海县", l: []}, {n: "勐腊县", l: []}]
    }, {
        n: "楚雄州",
        l: [{n: "元谋县", l: []}, {n: "南华县", l: []}, {n: "牟定县", l: []}, {
            n: "武定县",
            l: []
        }, {n: "大姚县", l: []}, {n: "双柏县", l: []}, {n: "禄丰县", l: []}, {
            n: "永仁县",
            l: []
        }, {n: "姚安县", l: []}, {n: "楚雄市", l: []}]
    }, {
        n: "大理州",
        l: [{n: "剑川县", l: []}, {n: "弥渡县", l: []}, {n: "云龙县", l: []}, {
            n: "洱源县",
            l: []
        }, {n: "鹤庆县", l: []}, {n: "宾川县", l: []}, {n: "祥云县", l: []}, {
            n: "永平县",
            l: []
        }, {n: "巍山县", l: []}, {n: "漾濞县", l: []}, {n: "南涧县", l: []}, {n: "大理市", l: []}]
    }, {
        n: "德宏州",
        l: [{n: "芒市", l: []}, {n: "瑞丽市", l: []}, {n: "盈江县", l: []}, {
            n: "梁河县",
            l: []
        }, {n: "陇川县", l: []}]
    }, {
        n: "怒江州",
        l: [{n: "泸水县", l: []}, {n: "福贡县", l: []}, {n: "兰坪县", l: []}, {n: "贡山县", l: []}]
    }, {n: "迪庆州", l: [{n: "香格里拉县", l: []}, {n: "德钦县", l: []}, {n: "维西县", l: []}]}]
}, {
    n: "西藏",
    l: [{
        n: "拉萨市",
        l: [{n: "城关区", l: []}, {n: "林周县", l: []}, {n: "当雄县", l: []}, {
            n: "尼木县",
            l: []
        }, {n: "曲水县", l: []}, {n: "堆龙德庆县", l: []}, {n: "达孜县", l: []}, {n: "墨竹工卡县", l: []}]
    }, {
        n: "那曲地区",
        l: [{n: "索县", l: []}, {n: "那曲县", l: []}, {n: "嘉黎县", l: []}, {
            n: "比如县",
            l: []
        }, {n: "聂荣县", l: []}, {n: "安多县", l: []}, {n: "申扎县", l: []}, {
            n: "班戈县",
            l: []
        }, {n: "巴青县", l: []}, {n: "尼玛县", l: []}]
    }, {
        n: "山南地区",
        l: [{n: "贡嘎县", l: []}, {n: "扎囊县", l: []}, {n: "乃东县", l: []}, {
            n: "桑日县",
            l: []
        }, {n: "琼结县", l: []}, {n: "曲松县", l: []}, {n: "措美县", l: []}, {
            n: "洛扎县",
            l: []
        }, {n: "加查县", l: []}, {n: "隆子县", l: []}, {n: "错那县", l: []}, {n: "浪卡子县", l: []}]
    }, {
        n: "昌都地区",
        l: [{n: "昌都县", l: []}, {n: "江达县", l: []}, {n: "贡觉县", l: []}, {
            n: "类乌齐县",
            l: []
        }, {n: "丁青县", l: []}, {n: "察雅县", l: []}, {n: "八宿县", l: []}, {
            n: "左贡县",
            l: []
        }, {n: "芒康县", l: []}, {n: "洛隆县", l: []}, {n: "边坝县", l: []}]
    }, {
        n: "日喀则地区",
        l: [{n: "聂拉木县", l: []}, {n: "昂仁县", l: []}, {n: "日喀则市", l: []}, {
            n: "南木林县",
            l: []
        }, {n: "江孜县", l: []}, {n: "定日县", l: []}, {n: "萨迦县　", l: []}, {
            n: "拉孜县",
            l: []
        }, {n: "谢通门县", l: []}, {n: "白朗县", l: []}, {n: "仁布县", l: []}, {
            n: "康马县",
            l: []
        }, {n: "定结县", l: []}, {n: "仲巴县", l: []}, {n: "亚东县", l: []}, {
            n: "吉隆县",
            l: []
        }, {n: "萨嘎县", l: []}, {n: "岗巴县", l: []}]
    }, {
        n: "阿里地区",
        l: [{n: "噶尔县", l: []}, {n: "普兰县", l: []}, {n: "札达县　", l: []}, {
            n: "日土县",
            l: []
        }, {n: "革吉县", l: []}, {n: "改则县", l: []}, {n: "措勤县", l: []}]
    }, {
        n: "林芝地区",
        l: [{n: "林芝县", l: []}, {n: "工布江达县", l: []}, {n: "米林县", l: []}, {
            n: "墨脱县",
            l: []
        }, {n: "波密县", l: []}, {n: "察隅县", l: []}, {n: "朗县", l: []}]
    }]
}, {
    n: "陕西",
    l: [{
        n: "西安市",
        l: [{n: "高陵县", l: []}, {n: "蓝田县", l: []}, {n: "户县", l: []}, {
            n: "周至县",
            l: []
        }, {n: "雁塔区", l: []}, {n: "未央区", l: []}, {n: "长安区", l: []}, {
            n: "灞桥区",
            l: []
        }, {n: "碑林区", l: []}, {n: "莲湖区", l: []}, {n: "临潼区", l: []}, {
            n: "阎良区",
            l: []
        }, {n: "杨凌农业示范区", l: []}, {n: "新城区", l: []}, {n: "西安武警工程学院", l: []}]
    }, {
        n: "铜川市",
        l: [{n: "印台区", l: []}, {n: "宜君县", l: []}, {n: "王益区", l: []}, {n: "耀州区", l: []}]
    }, {
        n: "宝鸡市",
        l: [{n: "岐山县", l: []}, {n: "太白县", l: []}, {n: "凤翔县", l: []}, {
            n: "陇县",
            l: []
        }, {n: "麟游县", l: []}, {n: "千阳县", l: []}, {n: "扶风县", l: []}, {
            n: "凤县",
            l: []
        }, {n: "眉县", l: []}, {n: "渭滨区", l: []}, {n: "金台区", l: []}, {n: "陈仓区", l: []}]
    }, {
        n: "咸阳市",
        l: [{n: "兴平市", l: []}, {n: "礼泉县", l: []}, {n: "泾阳县", l: []}, {
            n: "永寿县",
            l: []
        }, {n: "三原县", l: []}, {n: "彬县", l: []}, {n: "旬邑县", l: []}, {
            n: "长武县",
            l: []
        }, {n: "乾县", l: []}, {n: "武功县", l: []}, {n: "淳化县", l: []}, {
            n: "秦都区",
            l: []
        }, {n: "渭城区", l: []}, {n: "杨陵区", l: []}]
    }, {
        n: "渭南市",
        l: [{n: "韩城市", l: []}, {n: "华阴市", l: []}, {n: "蒲城县", l: []}, {
            n: "华县",
            l: []
        }, {n: "潼关县", l: []}, {n: "大荔县", l: []}, {n: "澄城县", l: []}, {
            n: "合阳县",
            l: []
        }, {n: "白水县", l: []}, {n: "富平县", l: []}, {n: "临渭区", l: []}]
    }, {
        n: "延安市",
        l: [{n: "安塞县", l: []}, {n: "洛川县", l: []}, {n: "子长县", l: []}, {
            n: "黄陵县",
            l: []
        }, {n: "延长县", l: []}, {n: "宜川县", l: []}, {n: "延川县", l: []}, {
            n: "甘泉县",
            l: []
        }, {n: "富县", l: []}, {n: "志丹县", l: []}, {n: "黄龙县", l: []}, {
            n: "吴起县",
            l: []
        }, {n: "宝塔区", l: []}]
    }, {
        n: "汉中市",
        l: [{n: "南郑县", l: []}, {n: "城固县", l: []}, {n: "洋县", l: []}, {
            n: "佛坪县",
            l: []
        }, {n: "留坝县", l: []}, {n: "镇巴县", l: []}, {n: "西乡县", l: []}, {
            n: "勉县",
            l: []
        }, {n: "略阳县", l: []}, {n: "宁强县", l: []}, {n: "汉台区", l: []}]
    }, {
        n: "榆林市",
        l: [{n: "清涧县", l: []}, {n: "绥德县", l: []}, {n: "佳县", l: []}, {
            n: "神木县",
            l: []
        }, {n: "府谷县", l: []}, {n: "子洲县", l: []}, {n: "横山县", l: []}, {
            n: "米脂县",
            l: []
        }, {n: "吴堡县", l: []}, {n: "定边县", l: []}, {n: "靖边县", l: []}, {n: "榆阳区", l: []}]
    }, {
        n: "商洛市",
        l: [{n: "商州区", l: []}, {n: "镇安县", l: []}, {n: "山阳县", l: []}, {
            n: "洛南县",
            l: []
        }, {n: "商南县", l: []}, {n: "丹凤县", l: []}, {n: "柞水县", l: []}]
    }, {
        n: "安康市",
        l: [{n: "紫阳县", l: []}, {n: "岚皋县", l: []}, {n: "旬阳县", l: []}, {
            n: "镇坪县",
            l: []
        }, {n: "平利县", l: []}, {n: "宁陕县", l: []}, {n: "汉阴县", l: []}, {
            n: "石泉县",
            l: []
        }, {n: "白河县", l: []}, {n: "汉滨区", l: []}]
    }]
}, {
    n: "甘肃",
    l: [{
        n: "兰州市",
        l: [{n: "永登县", l: []}, {n: "榆中县", l: []}, {n: "皋兰县", l: []}, {
            n: "西固区",
            l: []
        }, {n: "红古区", l: []}, {n: "七里河区", l: []}, {n: "安宁区", l: []}, {n: "城关区", l: []}]
    }, {n: "金昌市", l: [{n: "永昌县", l: []}, {n: "金川区", l: []}]}, {
        n: "白银市",
        l: [{n: "白银区", l: []}, {n: "平川区", l: []}, {n: "靖远县", l: []}, {
            n: "景泰县",
            l: []
        }, {n: "会宁县", l: []}]
    }, {
        n: "天水市",
        l: [{n: "甘谷县", l: []}, {n: "武山县", l: []}, {n: "清水县", l: []}, {
            n: "秦安县",
            l: []
        }, {n: "张家川县", l: []}, {n: "麦积区", l: []}, {n: "秦州区", l: []}]
    }, {
        n: "嘉峪关市",
        l: [{n: "雄关区", l: []}, {n: "长城区", l: []}, {n: "镜铁区", l: []}]
    }, {
        n: "平凉市",
        l: [{n: "华亭县", l: []}, {n: "崇信县", l: []}, {n: "泾川县", l: []}, {
            n: "灵台县",
            l: []
        }, {n: "镇原县", l: []}, {n: "庄浪县", l: []}, {n: "崆峒区", l: []}, {n: "静宁县", l: []}]
    }, {
        n: "庆阳市",
        l: [{n: "西峰区", l: []}, {n: "镇原县", l: []}, {n: "合水县", l: []}, {
            n: "华池县",
            l: []
        }, {n: "环县", l: []}, {n: "宁县", l: []}, {n: "正宁县", l: []}, {n: "庆城县", l: []}]
    }, {
        n: "陇南市",
        l: [{n: "成县", l: []}, {n: "礼县", l: []}, {n: "康县", l: []}, {
            n: "武都区",
            l: []
        }, {n: "文县", l: []}, {n: "两当县", l: []}, {n: "徽县", l: []}, {
            n: "宕昌县",
            l: []
        }, {n: "西和县", l: []}]
    }, {
        n: "武威市",
        l: [{n: "凉州区", l: []}, {n: "古浪县", l: []}, {n: "天祝县", l: []}, {n: "民勤县", l: []}]
    }, {
        n: "张掖市",
        l: [{n: "甘州区", l: []}, {n: "山丹县", l: []}, {n: "临泽县", l: []}, {
            n: "高台县",
            l: []
        }, {n: "肃南县", l: []}, {n: "民乐县", l: []}]
    }, {
        n: "酒泉市",
        l: [{n: "玉门市", l: []}, {n: "敦煌市", l: []}, {n: "金塔县", l: []}, {
            n: "阿克塞县",
            l: []
        }, {n: "肃北县", l: []}, {n: "瓜州县", l: []}, {n: "肃州区", l: []}]
    }, {
        n: "甘南州",
        l: [{n: "合作市", l: []}, {n: "夏河县", l: []}, {n: "碌曲县", l: []}, {
            n: "舟曲县",
            l: []
        }, {n: "玛曲县", l: []}, {n: "迭部县", l: []}, {n: "临潭县", l: []}, {n: "卓尼县", l: []}]
    }, {
        n: "临夏州",
        l: [{n: "临夏县", l: []}, {n: "康乐县", l: []}, {n: "永靖县", l: []}, {
            n: "和政县",
            l: []
        }, {n: "东乡族自治县", l: []}, {n: "积石山县", l: []}, {n: "临夏市", l: []}, {n: "广河县", l: []}]
    }, {
        n: "定西市",
        l: [{n: "岷县", l: []}, {n: "安定区", l: []}, {n: "通渭县", l: []}, {
            n: "临洮县",
            l: []
        }, {n: "漳县", l: []}, {n: "渭源县", l: []}, {n: "陇西县", l: []}]
    }]
}, {
    n: "青海",
    l: [{
        n: "西宁市",
        l: [{n: "湟中县", l: []}, {n: "湟源县", l: []}, {n: "大通县", l: []}, {
            n: "城中区",
            l: []
        }, {n: "城东区", l: []}, {n: "城西区", l: []}, {n: "城北区", l: []}]
    }, {
        n: "海东地区",
        l: [{n: "平安县", l: []}, {n: "乐都县", l: []}, {n: "民和县", l: []}, {
            n: "互助县",
            l: []
        }, {n: "化隆县", l: []}, {n: "循化县", l: []}]
    }, {
        n: "海北州",
        l: [{n: "海晏县", l: []}, {n: "祁连县", l: []}, {n: "刚察县", l: []}, {n: "门源县", l: []}]
    }, {
        n: "黄南州",
        l: [{n: "尖扎县", l: []}, {n: "同仁县", l: []}, {n: "泽库县", l: []}, {n: "河南县", l: []}]
    }, {
        n: "海南州",
        l: [{n: "共和县", l: []}, {n: "同德县", l: []}, {n: "贵德县", l: []}, {
            n: "兴海县",
            l: []
        }, {n: "贵南县", l: []}]
    }, {
        n: "果洛州",
        l: [{n: "玛沁县", l: []}, {n: "甘德县", l: []}, {n: "达日县", l: []}, {
            n: "班玛县",
            l: []
        }, {n: "久治县", l: []}, {n: "玛多县", l: []}]
    }, {
        n: "玉树州",
        l: [{n: "玉树县", l: []}, {n: "称多县", l: []}, {n: "囊谦县", l: []}, {
            n: "杂多县",
            l: []
        }, {n: "治多县", l: []}, {n: "曲麻莱县", l: []}]
    }, {
        n: "海西州",
        l: [{n: "德令哈市", l: []}, {n: "乌兰县", l: []}, {n: "天峻县", l: []}, {
            n: "都兰县",
            l: []
        }, {n: "大柴旦行委", l: []}, {n: "冷湖行委", l: []}, {n: "茫崖行委", l: []}, {n: "格尔木市", l: []}]
    }]
}, {
    n: "宁夏",
    l: [{
        n: "银川市",
        l: [{n: "灵武市", l: []}, {n: "永宁县", l: []}, {n: "贺兰县", l: []}, {
            n: "兴庆区",
            l: []
        }, {n: "金凤区", l: []}, {n: "西夏区", l: []}]
    }, {
        n: "石嘴山市",
        l: [{n: "平罗县", l: []}, {n: "惠农区", l: []}, {n: "大武口区", l: []}]
    }, {
        n: "吴忠市",
        l: [{n: "青铜峡市", l: []}, {n: "同心县", l: []}, {n: "盐池县", l: []}, {
            n: "红寺堡开发区",
            l: []
        }, {n: "利通区", l: []}]
    }, {
        n: "固原市",
        l: [{n: "西吉县", l: []}, {n: "隆德县", l: []}, {n: "泾源县", l: []}, {
            n: "彭阳县",
            l: []
        }, {n: "原州区", l: []}]
    }, {n: "中卫市", l: [{n: "中宁县", l: []}, {n: "海原县", l: []}, {n: "沙坡头区", l: []}]}]
}, {
    n: "新疆",
    l: [{
        n: "乌鲁木齐市",
        l: [{n: "乌鲁木齐县", l: []}, {n: "头屯河区", l: []}, {n: "达坂城区", l: []}, {
            n: "米东区",
            l: []
        }, {n: "天山区", l: []}, {n: "新市区", l: []}, {n: "沙依巴克区", l: []}, {n: "水磨沟区", l: []}]
    }, {
        n: "克拉玛依市",
        l: [{n: "克拉玛依区", l: []}, {n: "独山子区", l: []}, {n: "白碱滩区", l: []}, {
            n: "乌尔禾区",
            l: []
        }]
    }, {n: "石河子市", l: [{n: "石河子市", l: []}]}, {
        n: "吐鲁番地区",
        l: [{n: "吐鲁番市", l: []}, {n: "托克逊县", l: []}, {n: "鄯善县", l: []}]
    }, {
        n: "哈密地区",
        l: [{n: "哈密市", l: []}, {n: "巴里坤县", l: []}, {n: "伊吾县", l: []}]
    }, {
        n: "和田地区",
        l: [{n: "和田市", l: []}, {n: "墨玉县", l: []}, {n: "洛浦县", l: []}, {
            n: "策勒县",
            l: []
        }, {n: "于田县", l: []}, {n: "民丰县", l: []}, {n: "皮山县", l: []}, {n: "和田县", l: []}]
    }, {
        n: "阿克苏地区",
        l: [{n: "阿克苏市", l: []}, {n: "温宿县", l: []}, {n: "沙雅县", l: []}, {
            n: "拜城县",
            l: []
        }, {n: "阿瓦提县", l: []}, {n: "库车县", l: []}, {n: "柯坪县", l: []}, {
            n: "新和县",
            l: []
        }, {n: "乌什县", l: []}, {n: "阿拉尔市", l: []}]
    }, {
        n: "喀什地区",
        l: [{n: "喀什市", l: []}, {n: "巴楚县", l: []}, {n: "泽普县", l: []}, {
            n: "伽师县",
            l: []
        }, {n: "叶城县", l: []}, {n: "岳普湖县", l: []}, {n: "疏附县", l: []}, {
            n: "疏勒县",
            l: []
        }, {n: "英吉沙县", l: []}, {n: "麦盖提县", l: []}, {n: "莎车县", l: []}, {n: "塔什库尔干县", l: []}]
    }, {
        n: "克孜勒苏州",
        l: [{n: "阿图什市", l: []}, {n: "阿合奇县", l: []}, {n: "乌恰县", l: []}, {
            n: "阿克陶县",
            l: []
        }]
    }, {
        n: "巴音郭楞州",
        l: [{n: "库尔勒市", l: []}, {n: "尉犁县", l: []}, {n: "和静县", l: []}, {
            n: "博湖县",
            l: []
        }, {n: "和硕县", l: []}, {n: "轮台县", l: []}, {n: "若羌县", l: []}, {
            n: "且末县",
            l: []
        }, {n: "焉耆县", l: []}]
    }, {
        n: "昌吉州",
        l: [{n: "昌吉市", l: []}, {n: "阜康市", l: []}, {n: "奇台县", l: []}, {
            n: "玛纳斯县",
            l: []
        }, {n: "吉木萨尔县", l: []}, {n: "呼图壁县", l: []}, {n: "木垒县", l: []}]
    }, {
        n: "博尔塔拉州",
        l: [{n: "博乐市", l: []}, {n: "精河县", l: []}, {n: "温泉县", l: []}]
    }, {
        n: "伊犁州",
        l: [{n: "伊宁市", l: []}, {n: "特克斯县", l: []}, {n: "尼勒克县", l: []}, {
            n: "昭苏县",
            l: []
        }, {n: "新源县", l: []}, {n: "霍城县", l: []}, {n: "察布查尔县", l: []}, {
            n: "巩留县",
            l: []
        }, {n: "奎屯市", l: []}, {n: "伊宁县", l: []}]
    }, {
        n: "塔城地区",
        l: [{n: "塔城市", l: []}, {n: "乌苏市", l: []}, {n: "额敏县", l: []}, {
            n: "裕民县",
            l: []
        }, {n: "沙湾县", l: []}, {n: "托里县", l: []}, {n: "和布克赛尔县", l: []}]
    }, {
        n: "阿勒泰地区",
        l: [{n: "阿勒泰市", l: []}, {n: "富蕴县", l: []}, {n: "青河县", l: []}, {
            n: "吉木乃县",
            l: []
        }, {n: "布尔津县", l: []}, {n: "福海县", l: []}, {n: "哈巴河县", l: []}, {n: "北屯市", l: []}]
    }, {n: "五家渠市", l: [{n: "五家渠市", l: []}]}, {n: "博尔塔拉蒙古自治州阿拉山口口岸", l: []}, {
        n: "阿拉尔市",
        l: [{n: "阿拉尔市", l: []}]
    }, {n: "图木舒克市", l: [{n: "图木舒克市", l: []}]}]
}, {n: "台湾", l: [{n: "台湾", l: [{n: "台湾市区内", l: []}]}]}, {
    n: "香港",
    l: [{n: "香港特别行政区", l: [{n: "香港市区内", l: []}]}]
}, {n: "澳门", l: [{n: "澳门特别行政区", l: [{n: "澳门市区内", l: []}]}]}];